

local GroupProperties = {}

local defines = {}

------------------帕里斯（110201）& 索瑞尔（110101）缘分----------------------
local group = {
    mainID            = "1",
    groupName_EN      = "Elemental Infusion",
    groupName_CN      = "元素灌注",
    activateHero      = {"110201", "110101"},  -- 激活条件,也就是这两个英雄搭配的话可以激活这个

    ["110201"]        = {
        icon          = "140616",
        name_EN       = "The deffence will be promoted.",
        name_CN       = "帕里斯防御提升$15%$",
        armor         = {1, 11500},    -- 修改英雄身上的fireRange这个字段,0表示增加数值,1表示增加万分比
        reduceDamage  = {0, 560},      -- 修改英雄身上的fireRange这个字段,0表示增加数值,1表示增加万分比 
    -- addSkills     = {
        --     AIskill         = {         -- 技能ID*根据AI判断技能释放时机,例如:治疗技能、无敌等辅助技能
        --         {1, 0, "130201"},         -- 1表示自身血量,1500表示少于15%时会出发130241
        --         -- {2, 5000, "130241"},   -- 2表示自身每次攻击,5000表示有50%概率会出发130241
        --         -- {3, 10000, "130251"},  -- 3表示CD触发的技能,CD时间到了就会释放130251
        --     }, 
        --     passiveSkill    = {         -- 被动技能ID
        --         "130301", 
        --     },
        -- },
    },
    ["110101"]        = {
        icon          = "140616",
        name_EN       = "Thaurrer will be able to deal $3$ more damage.",
        name_CN       = "索瑞尔攻击力额外+$3$",
        attack        = {0, 3},        -- 修改英雄身上的fireRange这个字段,0表示增加数值,1表示增加万分比 
    -- addSkills     = {
        --     AIskill         = {         -- 技能ID*根据AI判断技能释放时机,例如:治疗技能、无敌等辅助技能
        --         {1, 0, "130201"},         -- 1表示自身血量,1500表示少于15%时会出发130241
        --         -- {2, 5000, "130241"},   -- 2表示自身每次攻击,5000表示有50%概率会出发130241
        --         -- {3, 10000, "130251"},  -- 3表示CD触发的技能,CD时间到了就会释放130251
        --     }, 
        --     passiveSkill    = {         -- 被动技能ID
        --         "130301", 
        --     },
        -- },
    },
}
defines["1"] = group -- 技能130101

------------------帕里斯（110201）& 塔奈尔（110202）缘分----------------------
local group = {
    mainID            = "2",
    groupName_EN      = "Tangled Steps",
    groupName_CN      = "迷幻之舞",
    activateHero      = {"110201", "110202"},  -- 激活条件,也就是这两个英雄搭配的话可以激活这个

    ["110201"]        = {
        icon          = "140620",
        name_EN       = "The dodge will +$50%$.",
        name_CN       = "帕里斯闪避效果提升$50%$",
        dodge         = {0, 2500},    -- 修改英雄身上的fireRange这个字段,0表示增加数值,1表示增加万分比 
        -- addSkills     = {
        --     AIskill         = {         -- 技能ID*根据AI判断技能释放时机,例如:治疗技能、无敌等辅助技能
        --         {1, 0, "130201"},         -- 1表示自身血量,1500表示少于15%时会出发130241
        --         -- {2, 5000, "130241"},   -- 2表示自身每次攻击,5000表示有50%概率会出发130241
        --         -- {3, 10000, "130251"},  -- 3表示CD触发的技能,CD时间到了就会释放130251
        --     }, 
        --     passiveSkill    = {         -- 被动技能ID
        --         "130301", 
        --     },
        -- },
    },
    ["110202"]        = {
        icon          = "140620",
        name_EN       = "When deal ordinary damage, Tah'nel can drain $2$ life from enemy.",
        name_CN       = "塔奈尔获得普攻吸血能力,普攻吸血+$5$",
        suckHp        = {0, 5},     -- 修改英雄身上的fireRange这个字段,0表示增加数值,1表示增加万分比 
    -- addSkills     = {
        --     AIskill         = {         -- 技能ID*根据AI判断技能释放时机,例如:治疗技能、无敌等辅助技能
        --         {1, 0, "130201"},         -- 1表示自身血量,1500表示少于15%时会出发130241
        --         -- {2, 5000, "130241"},   -- 2表示自身每次攻击,5000表示有50%概率会出发130241
        --         -- {3, 10000, "130251"},  -- 3表示CD触发的技能,CD时间到了就会释放130251
        --     }, 
        --     passiveSkill    = {         -- 被动技能ID
        --         "130301", 
        --     },
        -- },
    },
}
defines["2"] = group -- 技能130101

------------------帕里斯（110201）& 沙特（110102）缘分----------------------
local group = {
    mainID            = "3",
    groupName_EN      = "Lotus Walk",
    groupName_CN      = "徒步生莲",
    activateHero      = {"110201", "110102"},  -- 激活条件,也就是这两个英雄搭配的话可以激活这个

    ["110201"]        = {
        icon          = "140617",
        name_EN       = "Parris will be able to heal himself,restore +$4$ health every 3 second",
        name_CN       = "帕里斯获得自动回复能力,每3秒恢复$4$点生命",
        restoreHP     = {0, 4},    -- 修改英雄身上的fireRange这个字段,0表示增加数值,1表示增加万分比
    -- addSkills     = {
        --     AIskill         = {         -- 技能ID*根据AI判断技能释放时机,例如:治疗技能、无敌等辅助技能
        --         {1, 0, "130201"},         -- 1表示自身血量,1500表示少于15%时会出发130241
        --         -- {2, 5000, "130241"},   -- 2表示自身每次攻击,5000表示有50%概率会出发130241
        --         -- {3, 10000, "130251"},  -- 3表示CD触发的技能,CD时间到了就会释放130251
        --     }, 
        --     passiveSkill    = {         -- 被动技能ID
        --         "130301", 
        --     },
        -- },
    },
    ["110102"]        = {
        icon          = "140617",
        name_EN       = "Thaurrer will be able to deal $10$ more damage.",
        name_CN       = "沙特攻击力额外+$10$",
        attack        = {0, 10},    -- 修改英雄身上的fireRange这个字段,0表示增加数值,1表示增加万分比 
    -- addSkills     = {
        --     AIskill         = {         -- 技能ID*根据AI判断技能释放时机,例如:治疗技能、无敌等辅助技能
        --         {1, 0, "130201"},         -- 1表示自身血量,1500表示少于15%时会出发130241
        --         -- {2, 5000, "130241"},   -- 2表示自身每次攻击,5000表示有50%概率会出发130241
        --         -- {3, 10000, "130251"},  -- 3表示CD触发的技能,CD时间到了就会释放130251
        --     }, 
        --     passiveSkill    = {         -- 被动技能ID
        --         "130301", 
        --     },
        -- },
    },
}
defines["3"] = group -- 技能130101

------------------帕里斯（110201）& 凯尔（110203）缘分----------------------
local group = {
    mainID            = "4",
    groupName_EN      = "Spanking Wind",
    groupName_CN      = "风过留痕",
    activateHero      = {"110201", "110203"},  -- 激活条件,也就是这两个英雄搭配的话可以激活这个

    ["110201"]        = {
        icon          = "140618",
        name_EN       = "The cooldown of Elemental Recovery $-30%$.",
        name_CN       = "帕里斯技能$元素复苏$内置冷却缩短$30%$",
        changes       = {
            ["130201"]    = {                      -- 英雄被修改技能ID
                skillCD   = 63000,
            },
            ["130202"]    = {
                skillCD   = 49000,
            },
            ["130203"]    = {
                skillCD   = 35000,
            },
        },
    -- addSkills     = {
        --     AIskill         = {         -- 技能ID*根据AI判断技能释放时机,例如:治疗技能、无敌等辅助技能
        --         {1, 0, "130201"},         -- 1表示自身血量,1500表示少于15%时会出发130241
        --         -- {2, 5000, "130241"},   -- 2表示自身每次攻击,5000表示有50%概率会出发130241
        --         -- {3, 10000, "130251"},  -- 3表示CD触发的技能,CD时间到了就会释放130251
        --     }, 
        --     passiveSkill    = {         -- 被动技能ID
        --         "130301", 
        --     },
        -- },
    },
    ["110203"]        = {
        icon          = "140618",
        name_EN       = "The speed of Kael $+45%$.",
        name_CN       = "凯尔移动速度提升$45%$",
        speed         = {1, 14500},    -- 修改英雄身上的fireRange这个字段,0表示增加数值,1表示增加万分比 
    -- addSkills     = {
        --     AIskill         = {         -- 技能ID*根据AI判断技能释放时机,例如:治疗技能、无敌等辅助技能
        --         {1, 0, "130201"},         -- 1表示自身血量,1500表示少于15%时会出发130241
        --         -- {2, 5000, "130241"},   -- 2表示自身每次攻击,5000表示有50%概率会出发130241
        --         -- {3, 10000, "130251"},  -- 3表示CD触发的技能,CD时间到了就会释放130251
        --     }, 
        --     passiveSkill    = {         -- 被动技能ID
        --         "130301", 
        --     },
        -- },
    },
}
defines["4"] = group -- 技能130101

------------------帕里斯（110201）& 爱丽丝（110205）缘分----------------------
local group = {
    mainID            = "5",
    groupName_EN      = "Power Boom",
    groupName_CN      = "能量暴涨",
    activateHero      = {"110201", "110205"},  -- 激活条件,也就是这两个英雄搭配的话可以激活这个

    ["110201"]        = {
        icon          = "140610",
        name_EN       = "Parris will be able to summon 1 elemental more.",
        name_CN       = "帕里斯技能$召唤元素$召唤兵数量额外+$1$",
        changes       = {
            ["130101"]    = {                      -- 英雄被修改技能ID
                callUnit          = {10000, "170101", 3},  -- {召唤概率_召唤ID_召唤个数},召唤概率万分比,存活时间单位毫秒
            },
            ["130102"]    = {
                callUnit          = {10000, "170102", 3},  -- {召唤概率_召唤ID_召唤个数},召唤概率万分比,存活时间单位毫秒
            },
            ["130103"]    = {
                callUnit          = {10000, "170103", 3},  -- {召唤概率_召唤ID_召唤个数},召唤概率万分比,存活时间单位毫秒
            },
            ["130104"]    = {
                callUnit          = {10000, "170104", 3},  -- {召唤概率_召唤ID_召唤个数},召唤概率万分比,存活时间单位毫秒
            },
            ["130105"]    = {
                callUnit          = {10000, "170105", 3},  -- {召唤概率_召唤ID_召唤个数},召唤概率万分比,存活时间单位毫秒
            },
        },
        -- addSkills     = {
        --     AIskill         = {         -- 技能ID*根据AI判断技能释放时机,例如:治疗技能、无敌等辅助技能
        --         {1, 0, "130201"},         -- 1表示自身血量,1500表示少于15%时会出发130241
        --         -- {2, 5000, "130241"},   -- 2表示自身每次攻击,5000表示有50%概率会出发130241
        --         -- {3, 10000, "130251"},  -- 3表示CD触发的技能,CD时间到了就会释放130251
        --     }, 
        --     passiveSkill    = {         -- 被动技能ID
        --         "130301", 
        --     },
        -- },
    },
    ["110205"]        = {
        icon          = "140610",
        name_EN       = "The cooldown of Inspire $-10$.",
        name_CN       = "爱丽丝技能$潜能激发$冷却时间缩短$10$秒", 
        changes       = {
            ["130401"]    = {                      -- 英雄被修改技能ID
                skillCD   = 20000,
            },
            ["130402"]    = {                      -- 英雄被修改技能ID
                skillCD   = 20000,
            },
            ["130403"]    = {                      -- 英雄被修改技能ID
                skillCD   = 20000,
            },
        },
    -- addSkills     = {
        --     AIskill         = {         -- 技能ID*根据AI判断技能释放时机,例如:治疗技能、无敌等辅助技能
        --         {1, 0, "130201"},         -- 1表示自身血量,1500表示少于15%时会出发130241
        --         -- {2, 5000, "130241"},   -- 2表示自身每次攻击,5000表示有50%概率会出发130241
        --         -- {3, 10000, "130251"},  -- 3表示CD触发的技能,CD时间到了就会释放130251
        --     }, 
        --     passiveSkill    = {         -- 被动技能ID
        --         "130301", 
        --     },
        -- },
    },
}
defines["5"] = group -- 技能130101

------------------索瑞尔（110101）& 塔奈尔（110202）缘分----------------------
local group = {
    mainID            = "6",
    groupName_EN      = "Safeguard",
    groupName_CN      = "庇护卫士",
    activateHero      = {"110101", "110202"},  -- 激活条件,也就是这两个英雄搭配的话可以激活这个

    ["110101"]        = {
        icon          = "140601",
        name_EN       = "Convert Thaurrer's 25% attack into 15 defence.",
        name_CN       = "索瑞尔$25%$攻击转化为$15$点防御",
        attack        = {1, 7500},    -- 修改英雄身上的fireRange这个字段,0表示增加数值,1表示增加万分比
        armor         = {0, 15},   -- 修改英雄身上的fireRange这个字段,0表示增加数值,1表示增加万分比
        reduceDamage  = {0, 1125},     -- 修改英雄身上的fireRange这个字段,0表示增加数值,1表示增加万分比 
    -- addSkills     = {
        --     AIskill         = {         -- 技能ID*根据AI判断技能释放时机,例如:治疗技能、无敌等辅助技能
        --         {1, 0, "130201"},         -- 1表示自身血量,1500表示少于15%时会出发130241
        --         -- {2, 5000, "130241"},   -- 2表示自身每次攻击,5000表示有50%概率会出发130241
        --         -- {3, 10000, "130251"},  -- 3表示CD触发的技能,CD时间到了就会释放130251
        --     }, 
        --     passiveSkill    = {         -- 被动技能ID
        --         "130301", 
        --     },
        -- },
    },
    ["110202"]        = {
        icon          = "140601",
        name_EN       = "Tah'nel HP +20, Defence +10%.",
        name_CN       = "塔奈尔获得庇护效果,生命+$20$、防御+$10%$",
        maxHp         = {0, 20},       -- 修改英雄身上的fireRange这个字段,0表示增加数值,1表示增加万分比
        --attack        = {0, 1},      -- 修改英雄身上的fireRange这个字段,0表示增加数值,1表示增加万分比
        armor         = {1, 11000},    -- 修改英雄身上的fireRange这个字段,0表示增加数值,1表示增加万分比
        reduceDamage  = {0, 1250},      -- 修改英雄身上的fireRange这个字段,0表示增加数值,1表示增加万分比 
    -- addSkills     = {
        --     AIskill         = {         -- 技能ID*根据AI判断技能释放时机,例如:治疗技能、无敌等辅助技能
        --         {1, 0, "130201"},         -- 1表示自身血量,1500表示少于15%时会出发130241
        --         -- {2, 5000, "130241"},   -- 2表示自身每次攻击,5000表示有50%概率会出发130241
        --         -- {3, 10000, "130251"},  -- 3表示CD触发的技能,CD时间到了就会释放130251
        --     }, 
        --     passiveSkill    = {         -- 被动技能ID
        --         "130301", 
        --     },
        -- },
    },
}
defines["6"] = group -- 技能130101

------------------索瑞尔（110101）& 格若尔（110204）缘分----------------------
local group = {
    mainID            = "7",
    groupName_EN      = "Berserker",
    groupName_CN      = "狂暴斗士",
    activateHero      = {"110101", "110204"},  -- 激活条件,也就是这两个英雄搭配的话可以激活这个

    ["110101"]        = {
        icon          = "140608",
        name_EN       = "Convert Thaurrer's 25% defence into 5 attack.",
        name_CN       = "索瑞尔$25%$防御转化为$5$点攻击",
        attack        = {0, 5},    -- 修改英雄身上的fireRange这个字段,0表示增加数值,1表示增加万分比
        armor         = {1, 7500},     -- 修改英雄身上的fireRange这个字段,0表示增加数值,1表示增加万分比
        reduceDamage  = {0, -937},     -- 修改英雄身上的fireRange这个字段,0表示增加数值,1表示增加万分比 
    -- addSkills     = {
        --     AIskill         = {         -- 技能ID*根据AI判断技能释放时机,例如:治疗技能、无敌等辅助技能
        --         {1, 0, "130201"},         -- 1表示自身血量,1500表示少于15%时会出发130241
        --         -- {2, 5000, "130241"},   -- 2表示自身每次攻击,5000表示有50%概率会出发130241
        --         -- {3, 10000, "130251"},  -- 3表示CD触发的技能,CD时间到了就会释放130251
        --     }, 
        --     passiveSkill    = {         -- 被动技能ID
        --         "130301", 
        --     },
        -- },
    },
    ["110204"]        = {
        icon          = "140608",
        name_EN       = "The enemy's defence -35%.",
        name_CN       = "格若尔获得狂暴效果,攻击无视目标$35%$防御",
        --maxHp         = {0, 10},       -- 修改英雄身上的fireRange这个字段,0表示增加数值,1表示增加万分比
        --attack        = {0, 0.5},      -- 修改英雄身上的fireRange这个字段,0表示增加数值,1表示增加万分比
        --armor         = {1, 11000},    -- 修改英雄身上的fireRange这个字段,0表示增加数值,1表示增加万分比
        --reduceDamage  = {0, 500},      -- 修改英雄身上的fireRange这个字段,0表示增加数值,1表示增加万分比
        addReduceDamage   = {0, 3500},  -- 穿透率。值代表10000表示无视对方100%的免伤比例 
    -- addSkills     = {
        --     AIskill         = {         -- 技能ID*根据AI判断技能释放时机,例如:治疗技能、无敌等辅助技能
        --         {1, 0, "130201"},         -- 1表示自身血量,1500表示少于15%时会出发130241
        --         -- {2, 5000, "130241"},   -- 2表示自身每次攻击,5000表示有50%概率会出发130241
        --         -- {3, 10000, "130251"},  -- 3表示CD触发的技能,CD时间到了就会释放130251
        --     }, 
        --     passiveSkill    = {         -- 被动技能ID
        --         "130301", 
        --     },
        -- },
    },
}
defines["7"] = group -- 技能130101

------------------索瑞尔（110101）& 沙特（110102）缘分----------------------
local group = {
    mainID            = "8",
    groupName_EN      = "Mellow Ale",
    groupName_CN      = "醇香麦酒",
    activateHero      = {"110101", "110102"},  -- 激活条件,也就是这两个英雄搭配的话可以激活这个

    ["110101"]        = {
        icon          = "140609",
        name_EN       = "Thaurrer will be able to heal himself.restore +$6$ health every 3 second",
        name_CN       = "索瑞尔获得自动回复能力,每3秒恢复$6$点生命",
        restoreHP     = {0, 6},    -- 修改英雄身上的fireRange这个字段,0表示增加数值,1表示增加万分比 
    -- addSkills     = {
        --     AIskill         = {         -- 技能ID*根据AI判断技能释放时机,例如:治疗技能、无敌等辅助技能
        --         {1, 0, "130201"},         -- 1表示自身血量,1500表示少于15%时会出发130241
        --         -- {2, 5000, "130241"},   -- 2表示自身每次攻击,5000表示有50%概率会出发130241
        --         -- {3, 10000, "130251"},  -- 3表示CD触发的技能,CD时间到了就会释放130251
        --     }, 
        --     passiveSkill    = {         -- 被动技能ID
        --         "130301", 
        --     },
        -- },
    },
    ["110102"]        = {
        icon          = "140609",
        name_EN       = "Wrathful Deity now can slow 75% speed in 3 seconds.",
        name_CN       = "沙特技能$明王忿化$附加减速效果,$3秒$内移速-$75%$", 
        changes       = {
            ["130141"]    = {                      -- 英雄被修改技能ID
                hitState          = {
                    {10000, "200701"},             -- 击中目标状态, {附加概率_状态编号} 1000表示10%
                },
            },
            ["130142"]    = {                      -- 英雄被修改技能ID
                hitState          = {
                    {10000, "200701"},             -- 击中目标状态, {附加概率_状态编号} 1000表示10%
                },
            },
            ["130143"]    = {                      -- 英雄被修改技能ID
                hitState          = {
                    {10000, "200701"},             -- 击中目标状态, {附加概率_状态编号} 1000表示10%
                },
            },
            ["130144"]    = {                      -- 英雄被修改技能ID
                hitState          = {
                    {10000, "200701"},             -- 击中目标状态, {附加概率_状态编号} 1000表示10%
                },
            },
            ["130145"]    = {                      -- 英雄被修改技能ID
                hitState          = {
                    {10000, "200701"},             -- 击中目标状态, {附加概率_状态编号} 1000表示10%
                },
            },
        },
    -- addSkills     = {
        --     AIskill         = {           -- 技能ID*根据AI判断技能释放时机,例如:治疗技能、无敌等辅助技能
        --         {1, 0, "130201"},         -- 1表示自身血量,1500表示少于15%时会出发130241
        --         -- {2, 5000, "130241"},   -- 2表示自身每次攻击,5000表示有50%概率会出发130241
        --         -- {3, 10000, "130251"},  -- 3表示CD触发的技能,CD时间到了就会释放130251
        --     }, 
        --     passiveSkill    = {           -- 被动技能ID
        --         "130301", 
        --     },
        -- },
    },
}
defines["8"] = group -- 技能130101

------------------索瑞尔（110101）& 凯尔（110203）缘分----------------------
local group = {
    mainID            = "9",
    groupName_EN      = "Money Talks",
    groupName_CN      = "纸金迷醉",
    activateHero      = {"110101", "110203"},  -- 激活条件,也就是这两个英雄搭配的话可以激活这个

    ["110101"]        = {
        icon          = "140619",
        name_EN       = "Reflect $3$ damage when under attack.",
        name_CN       = "索瑞尔装备软猬甲,受攻击反弹$15$点伤害",
        addSkills     = {
        --     AIskill         = {         -- 技能ID*根据AI判断技能释放时机,例如:治疗技能、无敌等辅助技能
        --         {1, 0, "130201"},         -- 1表示自身血量,1500表示少于15%时会出发130241
        --         -- {2, 5000, "130241"},   -- 2表示自身每次攻击,5000表示有50%概率会出发130241
        --         -- {3, 10000, "130251"},  -- 3表示CD触发的技能,CD时间到了就会释放130251
        --     }, 
             passiveSkill    = {         -- 被动技能ID
                 "130351", 
             },
        },
    },
    ["110203"]        = {
        icon          = "140619",
        name_EN       = "There will be $25%$ more chance that Kael gain money from battle.",
        name_CN       = "凯尔技能$保护费$击中怪物获得金币概率额外+$25%$", 
        changes       = {
            ["130271"]    = {                      -- 英雄被修改技能ID
                    skillAddGold       = {7500, 2},  --技能击中60%概率获得2点金币
            },
            ["130272"]    = {                      -- 英雄被修改技能ID
                    skillAddGold       = {7500, 2},  --技能击中60%概率获得2点金币
            },
            ["130273"]    = {                      -- 英雄被修改技能ID
                    skillAddGold       = {7500, 2},  --技能击中60%概率获得2点金币
            },
            ["130274"]    = {                      -- 英雄被修改技能ID
                    skillAddGold       = {7500, 2},  --技能击中60%概率获得2点金币
            },
        },
    -- addSkills     = {
        --     AIskill         = {         -- 技能ID*根据AI判断技能释放时机,例如:治疗技能、无敌等辅助技能
        --         {1, 0, "130201"},         -- 1表示自身血量,1500表示少于15%时会出发130241
        --         -- {2, 5000, "130241"},   -- 2表示自身每次攻击,5000表示有50%概率会出发130241
        --         -- {3, 10000, "130251"},  -- 3表示CD触发的技能,CD时间到了就会释放130251
        --     }, 
        --     passiveSkill    = {         -- 被动技能ID
        --         "130301", 
        --     },
        -- },
    },
}
defines["9"] = group -- 技能130101

------------------索瑞尔（110101）& 爱丽丝（110205）缘分----------------------
local group = {
    mainID            = "10",
    groupName_EN      = "Vigorous",
    groupName_CN      = "精力充沛",
    activateHero      = {"110101", "110205"},  -- 激活条件,也就是这两个英雄搭配的话可以激活这个

    ["110101"]        = {
        icon          = "140606",
        name_EN       = "The MAX HP + $100$.",
        name_CN       = "索瑞尔基础生命+$100$",
        maxHp         = {0, 100},     -- 修改英雄身上的fireRange这个字段,0表示增加数值,1表示增加万分比
    -- addSkills     = {
        --     AIskill         = {         -- 技能ID*根据AI判断技能释放时机,例如:治疗技能、无敌等辅助技能
        --         {1, 0, "130201"},         -- 1表示自身血量,1500表示少于15%时会出发130241
        --         -- {2, 5000, "130241"},   -- 2表示自身每次攻击,5000表示有50%概率会出发130241
        --         -- {3, 10000, "130251"},  -- 3表示CD触发的技能,CD时间到了就会释放130251
        --     }, 
        --     passiveSkill    = {         -- 被动技能ID
        --         "130301", 
        --     },
        -- },
    },
    ["110205"]        = {
        icon          = "140606",
        name_EN       = "The MAX HP + $100$.",
        name_CN       = "爱丽丝基础生命+$100$", 
        maxHp         = {0, 100},     -- 修改英雄身上的fireRange这个字段,0表示增加数值,1表示增加万分比
    -- addSkills     = {
        --     AIskill         = {         -- 技能ID*根据AI判断技能释放时机,例如:治疗技能、无敌等辅助技能
        --         {1, 0, "130201"},         -- 1表示自身血量,1500表示少于15%时会出发130241
        --         -- {2, 5000, "130241"},   -- 2表示自身每次攻击,5000表示有50%概率会出发130241
        --         -- {3, 10000, "130251"},  -- 3表示CD触发的技能,CD时间到了就会释放130251
        --     }, 
        --     passiveSkill    = {         -- 被动技能ID
        --         "130301", 
        --     },
        -- },
    },
}
defines["10"] = group -- 技能130101

------------------塔奈尔（110202）& 格若尔（110204）缘分----------------------
local group = {
    mainID            = "11",
    groupName_EN      = "Elf Origin",
    groupName_CN      = "精灵起源",
    activateHero      = {"110202", "110204"},  -- 激活条件,也就是这两个英雄搭配的话可以激活这个

    ["110202"]        = {
        icon          = "140611",
        name_EN       = "Attack + 10 for 10 seconds randomly.",
        name_CN       = "战场中,塔奈尔可能获得来自格若尔协助,10秒内攻击+$10$",
    -- addSkills     = {
        --     AIskill         = {         -- 技能ID*根据AI判断技能释放时机,例如:治疗技能、无敌等辅助技能
        --         {1, 0, "130201"},         -- 1表示自身血量,1500表示少于15%时会出发130241
        --         -- {2, 5000, "130241"},   -- 2表示自身每次攻击,5000表示有50%概率会出发130241
        --         -- {3, 10000, "130251"},  -- 3表示CD触发的技能,CD时间到了就会释放130251
        --     }, 
        --     passiveSkill    = {         -- 被动技能ID
        --         "130301", 
        --     },
        -- },
    },
    ["110204"]        = {
        icon          = "140611",
        name_EN       = "Attack + 10 for 10 seconds randomly.",
        name_CN       = "战场中,格若尔可能获得来自塔奈尔协助,10秒内攻击+$10$", 
    -- addSkills     = {
        --     AIskill         = {         -- 技能ID*根据AI判断技能释放时机,例如:治疗技能、无敌等辅助技能
        --         {1, 0, "130201"},         -- 1表示自身血量,1500表示少于15%时会出发130241
        --         -- {2, 5000, "130241"},   -- 2表示自身每次攻击,5000表示有50%概率会出发130241
        --         -- {3, 10000, "130251"},  -- 3表示CD触发的技能,CD时间到了就会释放130251
        --     }, 
        --     passiveSkill    = {         -- 被动技能ID
        --         "130301", 
        --     },
        -- },
    },
}
defines["11"] = group -- 技能130101

------------------塔奈尔（110202）& 赛尔瑞（110301）缘分----------------------
local group = {
    mainID            = "12",
    groupName_EN      = "Mantra Blessing",
    groupName_CN      = "咒文加持",
    activateHero      = {"110202", "110301"},  -- 激活条件,也就是这两个英雄搭配的话可以激活这个

    ["110202"]        = {
        icon          = "140604",
        name_EN       = "Absorb damage equals to 35% HP every 30 seconds.",
        name_CN       = "塔奈尔每30秒开启1个30秒吸伤盾,当吸收相当$自身生命45%$的伤害时破掉",
        addSkills     = {
             AIskill         = {         -- 技能ID*根据AI判断技能释放时机,例如:治疗技能、无敌等辅助技能
        --         {1, 0, "130201"},         -- 1表示自身血量,1500表示少于15%时会出发130241
        --         -- {2, 5000, "130241"},   -- 2表示自身每次攻击,5000表示有50%概率会出发130241
                   {3, 30000, "130352"},  -- 3表示CD触发的技能,CD时间到了就会释放130251
             }, 
        --     passiveSkill    = {         -- 被动技能ID
        --         "130301", 
        --     },
        },
    },
    ["110301"]        = {
        icon          = "140604",
        name_EN       = "The Thorn Seed will slow 55% speed.",
        name_CN       = "赛尔瑞技能$荆棘之种$毒效果附加移速$-55%$", 
        changes       = {
            ["120151"]    = {                      -- 英雄被修改技能ID
                changeState = {                -- 第一个参数为0表示增加数值，1表示增加万分比 
                            speed         = {1, 4500},    -- 改变移动速度，离开区域移除效果
                    },
            },
            ["120152"]    = {                      -- 英雄被修改技能ID
                changeState = {                -- 第一个参数为0表示增加数值，1表示增加万分比 
                            speed         = {1, 4500},    -- 改变移动速度，离开区域移除效果
                    },
            },
            ["120153"]    = {                      -- 英雄被修改技能ID
                changeState = {                -- 第一个参数为0表示增加数值，1表示增加万分比 
                            speed         = {1, 4500},    -- 改变移动速度，离开区域移除效果
                    },
            },
            ["120154"]    = {                      -- 英雄被修改技能ID
                changeState = {                -- 第一个参数为0表示增加数值，1表示增加万分比 
                            speed         = {1, 4500},    -- 改变移动速度，离开区域移除效果
                    },
            },
        },
    -- addSkills     = {
        --     AIskill         = {         -- 技能ID*根据AI判断技能释放时机,例如:治疗技能、无敌等辅助技能
        --         {1, 0, "130201"},         -- 1表示自身血量,1500表示少于15%时会出发130241
        --         -- {2, 5000, "130241"},   -- 2表示自身每次攻击,5000表示有50%概率会出发130241
        --         -- {3, 10000, "130251"},  -- 3表示CD触发的技能,CD时间到了就会释放130251
        --     }, 
        --     passiveSkill    = {         -- 被动技能ID
        --         "130301", 
        --     },
        -- },
    },
}
defines["12"] = group -- 技能130101

------------------塔奈尔（110202）& 爱丽丝（110205）缘分----------------------
local group = {
    mainID            = "13",
    groupName_EN      = "Violent Storm",
    groupName_CN      = "骤雨暴风",
    activateHero      = {"110202", "110205"},  -- 激活条件,也就是这两个英雄搭配的话可以激活这个

    ["110202"]        = {
        icon          = "140612",
        name_EN       = "The critical strike chance +$25%$",
        name_CN       = "塔奈尔暴击率额外+$25%$",
        critical      = {0, 2500},    -- 修改英雄身上的fireRange这个字段,0表示增加数值,1表示增加万分比
    -- addSkills     = {
        --     AIskill         = {         -- 技能ID*根据AI判断技能释放时机,例如:治疗技能、无敌等辅助技能
        --         {1, 0, "130201"},         -- 1表示自身血量,1500表示少于15%时会出发130241
        --         -- {2, 5000, "130241"},   -- 2表示自身每次攻击,5000表示有50%概率会出发130241
        --         -- {3, 10000, "130251"},  -- 3表示CD触发的技能,CD时间到了就会释放130251
        --     }, 
        --     passiveSkill    = {         -- 被动技能ID
        --         "130301", 
        --     },
        -- },
    },
    ["110205"]        = {
        icon          = "140612",
        name_EN       = "The critical strike chance +$35%$",
        name_CN       = "爱丽丝暴击率额外+$35%$", 
        critical      = {0, 3500},    -- 修改英雄身上的fireRange这个字段,0表示增加数值,1表示增加万分比
    -- addSkills     = {
        --     AIskill         = {         -- 技能ID*根据AI判断技能释放时机,例如:治疗技能、无敌等辅助技能
        --         {1, 0, "130201"},         -- 1表示自身血量,1500表示少于15%时会出发130241
        --         -- {2, 5000, "130241"},   -- 2表示自身每次攻击,5000表示有50%概率会出发130241
        --         -- {3, 10000, "130251"},  -- 3表示CD触发的技能,CD时间到了就会释放130251
        --     }, 
        --     passiveSkill    = {         -- 被动技能ID
        --         "130301", 
        --     },
        -- },
    },
}
defines["13"] = group -- 技能130101

------------------格若尔（110204）& 赛尔瑞（110301）缘分----------------------
local group = {
    mainID            = "14",
    groupName_EN      = "Rosemary",
    groupName_CN      = "迷迭花香",
    activateHero      = {"110204", "110301"},  -- 激活条件,也就是这两个英雄搭配的话可以激活这个

    ["110204"]        = {
        icon          = "140615",
        name_EN       = "Quick Shot duration +$2$ second.",
        name_CN       = "格若尔技能$快速射击$暴走状态持续时间延长$2$秒",
        changes       = {
            ["130231"]    = {                      -- 英雄被修改技能ID
                selfState         = {
                    {10000, "210601"},       -- 附加自身状态, {附加概率_状态编号}
                },
            },
            ["130232"]    = {                      -- 英雄被修改技能ID
                selfState         = {
                    {10000, "210602"},       -- 附加自身状态, {附加概率_状态编号}
                },
            },
            ["130233"]    = {                      -- 英雄被修改技能ID
                selfState         = {
                    {10000, "210603"},       -- 附加自身状态, {附加概率_状态编号}
                },
            },
            ["130234"]    = {                       -- 英雄被修改技能ID
                selfState         = {
                    {10000, "210604"},       -- 附加自身状态, {附加概率_状态编号}
                },
            },
        },
    -- addSkills     = {
        --     AIskill         = {         -- 技能ID*根据AI判断技能释放时机,例如:治疗技能、无敌等辅助技能
        --         {1, 0, "130201"},         -- 1表示自身血量,1500表示少于15%时会出发130241
        --         -- {2, 5000, "130241"},   -- 2表示自身每次攻击,5000表示有50%概率会出发130241
        --         -- {3, 10000, "130251"},  -- 3表示CD触发的技能,CD时间到了就会释放130251
        --     }, 
        --     passiveSkill    = {         -- 被动技能ID
        --         "130301", 
        --     },
        -- },
    },
    ["110301"]        = {
        icon          = "140615",
        name_EN       = "There will be $25%$ more chance that Natural Seed can poison enemy.",
        name_CN       = "赛尔瑞技能$荆棘之种$中毒概率额外+$25%$", 
        changes       = {
            ["120151"]    = {                      -- 修改赛尔瑞1级荆棘岭区域
                addState          = {7500, "200501", 500},              -- 给区域内的目标增加状态,-- {附加概率_状态ID _附加间隔}
            },
            ["120152"]    = {                      -- 修改赛尔瑞2级荆棘岭区域
                addState          = {7500, "200502", 500},              -- 给区域内的目标增加状态,-- {附加概率_状态ID _附加间隔}
            },
            ["120153"]    = {                      -- 修改赛尔瑞3级荆棘岭区域
                addState          = {7500, "200503", 500},              -- 给区域内的目标增加状态,-- {附加概率_状态ID _附加间隔}
            },
            ["120154"]    = {                      -- 修改赛尔瑞4级荆棘岭区域
                addState          = {7500, "200504", 500},              -- 给区域内的目标增加状态,-- {附加概率_状态ID _附加间隔}
            },
        },
    -- addSkills     = {
        --     AIskill         = {         -- 技能ID*根据AI判断技能释放时机,例如:治疗技能、无敌等辅助技能
        --         {1, 0, "130201"},         -- 1表示自身血量,1500表示少于15%时会出发130241
        --         -- {2, 5000, "130241"},   -- 2表示自身每次攻击,5000表示有50%概率会出发130241
        --         -- {3, 10000, "130251"},  -- 3表示CD触发的技能,CD时间到了就会释放130251
        --     }, 
        --     passiveSkill    = {         -- 被动技能ID
        --         "130301", 
        --     },
        -- },
    },
}
defines["14"] = group -- 技能130101

------------------格若尔（110204）& 爱丽丝（110205）缘分----------------------
local group = {
    mainID            = "15",
    groupName_EN      = "Eagle Eye",
    groupName_CN      = "鹰眼准心",
    activateHero      = {"110204", "110205"},  -- 激活条件,也就是这两个英雄搭配的话可以激活这个

    ["110204"]        = {
        icon          = "140605",
        name_EN       = "The basic range +$80$ pixels.",
        name_CN       = "格若尔远程射击距离额外+$80$像素",
        fireVision    = {0, 80},    -- 修改英雄身上的fireRange这个字段,0表示增加数值,1表示增加万分比
    -- addSkills     = {
        --     AIskill         = {         -- 技能ID*根据AI判断技能释放时机,例如:治疗技能、无敌等辅助技能
        --         {1, 0, "130201"},         -- 1表示自身血量,1500表示少于15%时会出发130241
        --         -- {2, 5000, "130241"},   -- 2表示自身每次攻击,5000表示有50%概率会出发130241
        --         -- {3, 10000, "130251"},  -- 3表示CD触发的技能,CD时间到了就会释放130251
        --     }, 
        --     passiveSkill    = {         -- 被动技能ID
        --         "130301", 
        --     },
        -- },
    },
    ["110205"]        = {
        icon          = "140605",
        name_EN       = "The basic range +$80$ pixels.",
        name_CN       = "爱丽丝远程射击距离额外+$80$像素", 
        fireVision    = {0, 80},    -- 修改英雄身上的fireRange这个字段,0表示增加数值,1表示增加万分比
    -- addSkills     = {
        --     AIskill         = {         -- 技能ID*根据AI判断技能释放时机,例如:治疗技能、无敌等辅助技能
        --         {1, 0, "130201"},         -- 1表示自身血量,1500表示少于15%时会出发130241
        --         -- {2, 5000, "130241"},   -- 2表示自身每次攻击,5000表示有50%概率会出发130241
        --         -- {3, 10000, "130251"},  -- 3表示CD触发的技能,CD时间到了就会释放130251
        --     }, 
        --     passiveSkill    = {         -- 被动技能ID
        --         "130301", 
        --     },
        -- },
    },
}
defines["15"] = group -- 技能130101

------------------沙特（110102）& 凯尔（110203）缘分----------------------
local group = {
    mainID            = "16",
    groupName_EN      = "Recuperate",
    groupName_CN      = "休养生息",
    activateHero      = {"110102", "110203"},  -- 激活条件,也就是这两个英雄搭配的话可以激活这个

    ["110102"]        = {
        icon          = "140613",
        name_EN       = "When Retribution casted, heal 30% HP randomly.",
        name_CN       = "沙特技能$戒律棍$每次释放可能治疗自己$30%$生命",
        changes       = {
            ["130261"]    = {                      -- 修改1级龙吟技能
                selfState         = {
                    {6000, "210901"},              -- 附加自身状态, {附加概率_状态编号}
                },
            },
            ["130262"]    = {                      -- 修改2级龙吟技能
                selfState         = {
                    {6000, "210901"},              -- 附加自身状态, {附加概率_状态编号}
                },
            },
            ["130263"]    = {                      -- 修改3级龙吟技能
                selfState         = {
                    {6000, "210901"},              -- 附加自身状态, {附加概率_状态编号}
                },
            },
            ["130264"]    = {                      -- 修改4级龙吟技能
                selfState         = {
                    {6000, "210901"},              -- 附加自身状态, {附加概率_状态编号}
                },
            },
        },
    -- addSkills     = {
        --     AIskill         = {         -- 技能ID*根据AI判断技能释放时机,例如:治疗技能、无敌等辅助技能
        --         {1, 0, "130201"},         -- 1表示自身血量,1500表示少于15%时会出发130241
        --         -- {2, 5000, "130241"},   -- 2表示自身每次攻击,5000表示有50%概率会出发130241
        --         -- {3, 10000, "130251"},  -- 3表示CD触发的技能,CD时间到了就会释放130251
        --     }, 
        --     passiveSkill    = {         -- 被动技能ID
        --         "130301", 
        --     },
        -- },
    },
    ["110203"]        = {
        icon          = "140613",
        name_EN       = "Kael can heal himself,restore +$8$ health every 3 second",
        name_CN       = "凯尔获得自动回复能力,每3秒恢复$8$点生命",
        restoreHP     = {0, 8},    -- 修改英雄身上的fireRange这个字段,0表示增加数值,1表示增加万分比
    -- addSkills     = {
        --     AIskill         = {         -- 技能ID*根据AI判断技能释放时机,例如:治疗技能、无敌等辅助技能
        --         {1, 0, "130201"},         -- 1表示自身血量,1500表示少于15%时会出发130241
        --         -- {2, 5000, "130241"},   -- 2表示自身每次攻击,5000表示有50%概率会出发130241
        --         -- {3, 10000, "130251"},  -- 3表示CD触发的技能,CD时间到了就会释放130251
        --     }, 
        --     passiveSkill    = {         -- 被动技能ID
        --         "130301", 
        --     },
        -- },
    },
}
defines["16"] = group -- 技能130101

------------------沙特（110102）& 赛尔瑞（110301）缘分----------------------
local group = {
    mainID            = "17",
    groupName_EN      = "Life Emancipation",
    groupName_CN      = "普度众生",
    activateHero      = {"110102", "110301"},  -- 激活条件,也就是这两个英雄搭配的话可以激活这个

    ["110102"]        = {
        icon          = "140621",
        name_EN       = "Retribution now can deal 10 damage every second for 4 seconds.",
        name_CN       = "沙特技能$戒律棍$每次释放附加持续伤害,$4秒内每0.5秒造成20点伤害$",
        changes       = {
            ["130261"]    = {                      -- 1级龙吟技能额外添加状态200801
                hitState          = {
                    {10000, "200201"}, {10000, "200801"},    -- 击中目标状态, {附加概率_状态编号} 1000表示10%
                },
            },
            ["130262"]    = {                      -- 2级龙吟技能额外添加状态200801
                hitState          = {
                    {10000, "200202"}, {10000, "200801"},    -- 击中目标状态, {附加概率_状态编号} 1000表示10%
                },
            },
            ["130263"]    = {                      -- 3级龙吟技能额外添加状态200801
                hitState          = {
                    {10000, "200203"}, {10000, "200801"},    -- 击中目标状态, {附加概率_状态编号} 1000表示10%
                },
            },
            ["130264"]    = {                      -- 4级龙吟技能额外添加状态200801
                hitState          = {
                    {10000, "200204"}, {10000, "200801"},    -- 击中目标状态, {附加概率_状态编号} 1000表示10%
                },
            },
        },
    -- addSkills     = {
        --     AIskill         = {         -- 技能ID*根据AI判断技能释放时机,例如:治疗技能、无敌等辅助技能
        --         {1, 0, "130201"},         -- 1表示自身血量,1500表示少于15%时会出发130241
        --         -- {2, 5000, "130241"},   -- 2表示自身每次攻击,5000表示有50%概率会出发130241
        --         -- {3, 10000, "130251"},  -- 3表示CD触发的技能,CD时间到了就会释放130251
        --     }, 
        --     passiveSkill    = {         -- 被动技能ID
        --         "130301", 
        --     },
        -- },
    },

    ["110301"]        = {
        icon          = "140621",
        name_EN       = "The cooldown of Anima Dew -$10$ second.",
        name_CN       = "赛尔瑞技能$生命之露$冷却时间缩短$10$秒", 
        changes       = {
            ["130161"]    = {                      --1级赛尔瑞雨润技能CD-8秒
                skillCD   = 30000,
            },
            ["130162"]    = {                      --1级赛尔瑞雨润技能CD-8秒
                skillCD   = 30000,
            },
            ["130163"]    = {                      --1级赛尔瑞雨润技能CD-8秒
                skillCD   = 30000,
            },
            ["130164"]    = {                      --1级赛尔瑞雨润技能CD-8秒
                skillCD   = 30000,
            },
            ["130165"]    = {                      --1级赛尔瑞雨润技能CD-8秒
                skillCD   = 30000,
            },
        },
    -- addSkills     = {
        --     AIskill         = {         -- 技能ID*根据AI判断技能释放时机,例如:治疗技能、无敌等辅助技能
        --         {1, 0, "130201"},         -- 1表示自身血量,1500表示少于15%时会出发130241
        --         -- {2, 5000, "130241"},   -- 2表示自身每次攻击,5000表示有50%概率会出发130241
        --         -- {3, 10000, "130251"},  -- 3表示CD触发的技能,CD时间到了就会释放130251
        --     }, 
        --     passiveSkill    = {         -- 被动技能ID
        --         "130301", 
        --     },
        -- },
    },
}
defines["17"] = group -- 技能130101

------------------沙特（110102）& 爱丽丝（110205）缘分----------------------
local group = {
    mainID            = "18",
    groupName_EN      = "Unassailable",
    groupName_CN      = "无懈可击",
    activateHero      = {"110102", "110205"},  -- 激活条件,也就是这两个英雄搭配的话可以激活这个

    ["110102"]        = {
        icon          = "140607",
        name_EN       = "The deffence of Shatt +200%.",
        name_CN       = "沙特防御额外+$200%$",
        armor         = {1, 30000},    -- 修改英雄身上的fireRange这个字段,0表示增加数值,1表示增加万分比
        reduceDamage  = {0, 4000},      -- 修改英雄身上的fireRange这个字段,0表示增加数值,1表示增加万分比
    -- addSkills     = {
        --     AIskill         = {         -- 技能ID*根据AI判断技能释放时机,例如:治疗技能、无敌等辅助技能
        --         {1, 0, "130201"},         -- 1表示自身血量,1500表示少于15%时会出发130241
        --         -- {2, 5000, "130241"},   -- 2表示自身每次攻击,5000表示有50%概率会出发130241
        --         -- {3, 10000, "130251"},  -- 3表示CD触发的技能,CD时间到了就会释放130251
        --     }, 
        --     passiveSkill    = {         -- 被动技能ID
        --         "130301", 
        --     },
        -- },
    },
    ["110205"]        = {
        icon          = "140607",
        name_EN       = "The deffence of Ellis +100%.",
        name_CN       = "爱丽丝防御额外+$100%$", 
        armor         = {1, 20000},    -- 修改英雄身上的fireRange这个字段,0表示增加数值,1表示增加万分比
        reduceDamage  = {0, 2000},      -- 修改英雄身上的fireRange这个字段,0表示增加数值,1表示增加万分比
    -- addSkills     = {
        --     AIskill         = {         -- 技能ID*根据AI判断技能释放时机,例如:治疗技能、无敌等辅助技能
        --         {1, 0, "130201"},         -- 1表示自身血量,1500表示少于15%时会出发130241
        --         -- {2, 5000, "130241"},   -- 2表示自身每次攻击,5000表示有50%概率会出发130241
        --         -- {3, 10000, "130251"},  -- 3表示CD触发的技能,CD时间到了就会释放130251
        --     }, 
        --     passiveSkill    = {         -- 被动技能ID
        --         "130301", 
        --     },
        -- },
    },
}
defines["18"] = group -- 技能130101

------------------凯尔（110203）& 赛尔瑞（110301）缘分----------------------
local group = {
    mainID            = "19",
    groupName_EN      = "Perpetual Brook",
    groupName_CN      = "细水长流",
    activateHero      = {"110203", "110301"},  -- 激活条件,也就是这两个英雄搭配的话可以激活这个

    ["110203"]        = {
        icon          = "140602",
        name_EN       = "A golden leaf and 5%-15% coins you cost will be given back.",
        name_CN       = "凯尔技能$花钱消灾$释放后飘落一片金羽,拾取后获得所消耗金币的$5%-15%$", --该比例程序写死在代码内
    -- addSkills     = {
        --     AIskill         = {         -- 技能ID*根据AI判断技能释放时机,例如:治疗技能、无敌等辅助技能
        --         {1, 0, "130201"},         -- 1表示自身血量,1500表示少于15%时会出发130241
        --         -- {2, 5000, "130241"},   -- 2表示自身每次攻击,5000表示有50%概率会出发130241
        --         -- {3, 10000, "130251"},  -- 3表示CD触发的技能,CD时间到了就会释放130251
        --     }, 
        --     passiveSkill    = {         -- 被动技能ID
        --         "130301", 
        --     },
        -- },
    },
    ["110301"]        = {
        icon          = "140602",
        name_EN       = "When Anima Dew casted,give back a dew,a hero's MAX HP boosts to $135%$ for 30 seconds.",
        name_CN       = "赛尔瑞技能$生命之露$释放后飘落一片杏花,拾取后随机使一个英雄$30秒内生命提升35%$", 

        addBuffId     = "220905",     -- 30秒内生命上限提升35% 的buff ID
    },
}
defines["19"] = group -- 技能130101

------------------凯尔（110203）& 爱丽丝（110205）缘分----------------------
local group = {
    mainID            = "20",
    groupName_EN      = "Elemental Flow",
    groupName_CN      = "元素流转",
    activateHero      = {"110203", "110205"},  -- 激活条件,也就是这两个英雄搭配的话可以激活这个

    ["110203"]        = {
        icon          = "140603",
        name_EN       = "Money For Safety +30% pixels area coverage.",
        name_CN       = "凯尔技能$花钱消灾$区域范围额外+$30$像素",
        changes       = {
            ["130151"]    = {                --1级翅金羽子弹替换
                manualRange     = 70,             -- 手指范围,单位:像素
                bulletType      = "150611",        -- 子弹类型,1=箭射,2=爆炸,3=链锁,4=回旋,5=扩散,6=坠砸
            },
            ["130152"]    = {                --2级翅金羽子弹替换
                manualRange     = 70,             -- 手指范围,单位:像素
                bulletType      = "150612",        -- 子弹类型,1=箭射,2=爆炸,3=链锁,4=回旋,5=扩散,6=坠砸
            },
            ["130153"]    = {                --3级翅金羽子弹替换
                manualRange     = 70,             -- 手指范围,单位:像素
                bulletType      = "150613",        -- 子弹类型,1=箭射,2=爆炸,3=链锁,4=回旋,5=扩散,6=坠砸
            },
            ["130154"]    = {                --4级翅金羽子弹替换
                manualRange     = 70,             -- 手指范围,单位:像素
                bulletType      = "150614",        -- 子弹类型,1=箭射,2=爆炸,3=链锁,4=回旋,5=扩散,6=坠砸
            },
            ["130155"]    = {                --5级翅金羽子弹替换
                manualRange     = 70,             -- 手指范围,单位:像素
                bulletType      = "150615",        -- 子弹类型,1=箭射,2=爆炸,3=链锁,4=回旋,5=扩散,6=坠砸
            },
        },
    -- addSkills     = {
        --     AIskill         = {         -- 技能ID*根据AI判断技能释放时机,例如:治疗技能、无敌等辅助技能
        --         {1, 0, "130201"},         -- 1表示自身血量,1500表示少于15%时会出发130241
        --         -- {2, 5000, "130241"},   -- 2表示自身每次攻击,5000表示有50%概率会出发130241
        --         -- {3, 10000, "130251"},  -- 3表示CD触发的技能,CD时间到了就会释放130251
        --     }, 
        --     passiveSkill    = {         -- 被动技能ID
        --         "130301", 
        --     },
        -- },
    },
    ["110205"]        = {
        icon          = "140603",
        name_EN       = "Ignite a burning area where the meteors hit for 8 seconds. 35 damage per 0.5 second.",
        name_CN       = "爱丽丝技能$群星降落$会在击中区域燃起一片8秒火海区域,$每0.5秒-35点生命$", 
    -- addSkills     = {
        --     AIskill         = {         -- 技能ID*根据AI判断技能释放时机,例如:治疗技能、无敌等辅助技能
        --         {1, 0, "130201"},         -- 1表示自身血量,1500表示少于15%时会出发130241
        --         -- {2, 5000, "130241"},   -- 2表示自身每次攻击,5000表示有50%概率会出发130241
        --         -- {3, 10000, "130251"},  -- 3表示CD触发的技能,CD时间到了就会释放130251
        --     }, 
        --     passiveSkill    = {         -- 被动技能ID
        --         "130301", 
        --     },
        -- },
    },
}
defines["20"] = group -- 技能130101

------------------赛尔瑞（110301）& 爱丽丝（110205）缘分----------------------
local group = {
    mainID            = "21",
    groupName_EN      = "Elemental Turbine",
    groupName_CN      = "潜能漩涡",
    activateHero      = {"110301", "110205"},  -- 激活条件,也就是这两个英雄搭配的话可以激活这个

    ["110301"]        = {
        icon          = "140614",
        name_EN       = "When Inspire casted, enlarge next Anima Dew's range by 3 times. It is cumulative.",
        name_CN       = "爱丽丝释放$潜能激发$,可能使赛尔瑞下次$生命之露$治疗范围扩大$3$倍。该次数可以被累积。",
        changes       = {
            ["130161"]    = {                --1级赛尔瑞雨润杏花子
                manualRange       = 180,          -- 手指范围,单位:像素
                bulletType      = "150526",        -- 子弹类型,1=箭射,2=爆炸,3=链锁,4=回旋,5=扩散,6=坠砸
            },
            ["130162"]    = {                --1级赛尔瑞雨润杏花子
                manualRange       = 180,          -- 手指范围,单位:像素
                bulletType      = "150526",        -- 子弹类型,1=箭射,2=爆炸,3=链锁,4=回旋,5=扩散,6=坠砸
            },
            ["130163"]    = {                --1级赛尔瑞雨润杏花子
                manualRange       = 180,          -- 手指范围,单位:像素
                bulletType      = "150526",        -- 子弹类型,1=箭射,2=爆炸,3=链锁,4=回旋,5=扩散,6=坠砸
            },
            ["130164"]    = {                --1级赛尔瑞雨润杏花子
                manualRange       = 180,          -- 手指范围,单位:像素
                bulletType      = "150526",        -- 子弹类型,1=箭射,2=爆炸,3=链锁,4=回旋,5=扩散,6=坠砸
            },
            ["130165"]    = {                --1级赛尔瑞雨润杏花子
                manualRange       = 180,          -- 手指范围,单位:像素
                bulletType      = "150526",        -- 子弹类型,1=箭射,2=爆炸,3=链锁,4=回旋,5=扩散,6=坠砸
            },
        },
    -- addSkills     = {
        --     AIskill         = {         -- 技能ID*根据AI判断技能释放时机,例如:治疗技能、无敌等辅助技能
        --         {1, 0, "130201"},         -- 1表示自身血量,1500表示少于15%时会出发130241
        --         -- {2, 5000, "130241"},   -- 2表示自身每次攻击,5000表示有50%概率会出发130241
        --         -- {3, 10000, "130251"},  -- 3表示CD触发的技能,CD时间到了就会释放130251
        --     }, 
        --     passiveSkill    = {         -- 被动技能ID
        --         "130301", 
        --     },
        -- },
    },
    ["110205"]        = {
        icon          = "140614",
        name_EN       = "Elis can change the weather for 15 seconds when Inspire is casted.",
        name_CN       = "爱丽丝释放$潜能激发$,可能引起天变,飘下晴/雨/风/夜/雪,拾取任一可改变为相应天气$15秒$", 
    -- addSkills     = {
        --     AIskill         = {         -- 技能ID*根据AI判断技能释放时机,例如:治疗技能、无敌等辅助技能
        --         {1, 0, "130201"},         -- 1表示自身血量,1500表示少于15%时会出发130241
        --         -- {2, 5000, "130241"},   -- 2表示自身每次攻击,5000表示有50%概率会出发130241
        --         -- {3, 10000, "130251"},  -- 3表示CD触发的技能,CD时间到了就会释放130251
        --     }, 
        --     passiveSkill    = {         -- 被动技能ID
        --         "130301", 
        --     },
        -- },
    },
}
defines["21"] = group -- 技能130101

function GroupProperties.get(id)
    -- print("GroupProperties.get(id) id = "..tostring(id))
    return clone(defines[id])
end

function GroupProperties.getAll()
    -- print("GroupProperties.getAll")
    return clone(defines)
end

return GroupProperties