

local RMBSkillProperties = {}

local defines = {}

------------------全屏控制----------------------
local skill = {
    mainID            = "710101",
    name              = "时间沙漏",
    icon              = "710101",
    featureSkill      = "animationName", -- 特写动画
    level             = 1,               -- 等级
    effect            = "effectName",    -- 释放光效
    sound             = "Delivery",     -- 音效
    weatherValue      = {10000, 10000, 10000, 10000, 10000}, -- {晴天_夜晚_雨天_雪天_风天}技能的伤害系数
    powerCost         = {3, 15},        -- {能量类型_数量} 能量类型, 0/1/2/3依次表示无消耗/金钱/MP/购买钻石, 数量，具体消耗数值
    skillCD           = 5000,           -- 技能冷却CD
    CDplace           = 61,               -- CD冷却占位
    castTime          = 0,               -- 技能吟唱时间,单位：毫秒
    bootTime          = 0,               -- 技能吟唱时间，单位：毫秒
    skillText         = "$冷却5秒$。全屏范围内随机使$3-5$个怪退回一段距离",
    monsterCount      = {3, 5},          -- 回退怪物的数量，随机使2-5个怪物回退
    returnCount       = 5,               -- 把怪物往回退3个路径点
    --actionObject      = {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},  -- {自己_英雄队伍_召唤兵_箭塔_炮塔_法师塔_祭坛塔_地面怪物_地下怪物_空中怪物}
    --bulletType        = "",              -- 子弹类型，1=箭射，2=爆炸，3=链锁，4=回旋，5=扩散，6=坠砸
    --trajectory        = 1,               -- 子弹轨迹，1=直线2=抛物线3=跟踪转圈
    --attackType        = 2,               -- 1=真实伤害，2=护伤害甲，3=治疗
    --skillAttack       = {0, 0, 0},       -- {X_数据源_Y} 威力程式=X*数据源+Y ， X=10000表示100%
                                         --   0=无，1=攻击，2=护甲，3=最大生命，4=当前生命5=闪避率，
                                         --   6=暴击率，7=暴击威力，8=当前金币，9=目标最大生命，10=目标当前生命
    --hitState          = {
    --   {10000, "200204"},       -- 击中目标状态, {附加概率_状态编号} 1000表示10%
    --},
    --selfState         = {
    --    {10000, "210103"},       -- 附加自身状态, {附加概率_状态编号}
    --},
    --callUnit          = {10000, "170101", 3},  -- {召唤概率_召唤ID_召唤个数},召唤概率万分比，存活时间单位毫秒
    --cleansing           = 10000,      --净化概率,净化掉不利BUFF
    --dispel            = 10000,      --驱散概率,驱散掉有利BUFF
}
defines["710101"] = skill -- 技能130101

------------------全屏强化----------------------
local skill = {
    mainID            = "710201",
    name              = "光辉宝珠",
    icon              = "710201",
    featureSkill      = "animationName", -- 特写动画
    level             = 2,               -- 等级
    effect            = "effectName",    -- 释放光效
    sound             = "Horn",     -- 音效
    weatherValue      = {10000, 10000, 10000, 10000, 10000}, -- {晴天_夜晚_雨天_雪天_风天}技能的伤害系数
    powerCost         = {3, 5},        -- {能量类型_数量} 能量类型,0/1/2/3依次表示无消耗/金钱/MP/钻石, 数量，具体消耗数值
    skillCD           = 15000,           -- 技能冷却CD
    CDplace           = 62,               -- CD冷却占位
    castTime          = 0,               -- 技能吟唱时间,单位：毫秒
    bootTime          = 0,               -- 技能吟唱时间，单位：毫秒
    skillText         = "$冷却15秒$。全屏范围内随机强化最多$4$个防御塔，使其$15秒内攻击+50%$",
    towerCount        = 4,               -- 强化塔的数量
    addBuffID         = "220906",        -- 给塔加的Buff ID
    actionObject      = {0, 0, 0, 1, 1, 1, 0, 0, 0, 0},  -- {自己_英雄队伍_召唤兵_箭塔_炮塔_法师塔_祭坛塔_地面怪物_地下怪物_空中怪物}
    --bulletType        = "",              -- 子弹类型，1=箭射，2=爆炸，3=链锁，4=回旋，5=扩散，6=坠砸
    --trajectory        = 1,               -- 子弹轨迹，1=直线2=抛物线3=跟踪转圈
    --attackType        = 2,               -- 1=真实伤害，2=护伤害甲，3=治疗
    --skillAttack       = {0, 0, 0},       -- {X_数据源_Y} 威力程式=X*数据源+Y ， X=10000表示100%
                                         --   0=无，1=攻击，2=护甲，3=最大生命，4=当前生命5=闪避率，
                                         --   6=暴击率，7=暴击威力，8=当前金币，9=目标最大生命，10=目标当前生命
    --hitState          = {
    --   {10000, "200204"},       -- 击中目标状态, {附加概率_状态编号} 1000表示10%
    --},
    --selfState         = {
    --    {10000, "210103"},       -- 附加自身状态, {附加概率_状态编号}
    --},
    --callUnit          = {10000, "170102", 3},  -- {召唤概率_召唤ID_召唤个数},召唤概率万分比，存活时间单位毫秒
    --cleansing           = 10000,      --净化概率,净化掉不利BUFF
    --dispel            = 10000,      --驱散概率,驱散掉有利BUFF
}
defines["710201"] = skill

------------------全屏伤害----------------------
local skill = {
    mainID            = "710301",
    name              = "雷霆卷轴",
    icon              = "710301",
    featureSkill      = "animationName", -- 特写动画
    level             = 3,               -- 等级
    effect            = "effectName",    -- 释放光效
    --sound             = "Armageddon",     -- 音效
    weatherValue      = {10000, 10000, 10000, 10000, 10000}, -- {晴天_夜晚_雨天_雪天_风天}技能的伤害系数
    powerCost         = {3, 10},        -- {能量类型_数量} 能量类型, 0/1/2/3依次表示无消耗/金钱/MP/钻石, 数量，具体消耗数值
    skillCD           = 30000,           -- 技能冷却CD
    CDplace           = 63,               -- CD冷却占位
    castTime          = 0,               -- 技能吟唱时间,单位：毫秒
    bootTime          = 0,               -- 技能吟唱时间，单位：毫秒
    skillText         = "$冷却30秒$。全屏范围内同时随机劈下$7$条雷电，造成$巨量伤害$",
    actionObject      = {0, 0, 0, 0, 0, 0, 0, 1, 1, 1},  -- {自己_英雄队伍_召唤兵_箭塔_炮塔_法师塔_祭坛塔_地面怪物_地下怪物_空中怪物}
    bulletType        = "150616",              -- 子弹类型，1=箭射，2=爆炸，3=链锁，4=回旋，5=扩散，6=坠砸
    trajectory        = 1,               -- 子弹轨迹，1=直线2=抛物线3=跟踪转圈
    attackType        = 2,               -- 1=真实伤害，2=护伤害甲，3=治疗
    skillAttack       = {0, 0, 500},       -- {X_数据源_Y} 威力程式=X*数据源+Y ， X=10000表示100%
                                         --   0=无，1=攻击，2=护甲，3=最大生命，4=当前生命5=闪避率，
                                         --   6=暴击率，7=暴击威力，8=当前金币，9=目标最大生命，10=目标当前生命
    --hitState          = {
    --   {10000, "200204"},       -- 击中目标状态, {附加概率_状态编号} 1000表示10%
    --},
    --selfState         = {
    --    {10000, "210103"},       -- 附加自身状态, {附加概率_状态编号}
    --},
    --callUnit          = {10000, "170103", 3},  -- {召唤概率_召唤ID_召唤个数},召唤概率万分比，存活时间单位毫秒
    --cleansing           = 10000,      --净化概率,净化掉不利BUFF
    --dispel            = 10000,      --驱散概率,驱散掉有利BUFF
}
defines["710301"] = skill


function RMBSkillProperties.get(id)
    -- print("RMBSkillProperties.get(id) id = "..tostring(id))
    return clone(defines[id])
end

function RMBSkillProperties.getAll()
    -- print("RMBSkillProperties.getAll")
    return clone(defines)
end

return RMBSkillProperties