
local MonsterOrder = {}

local MonsterOrder = {}

local defines = {
---------------恶魔军团-------------
    "100401",--小恶魔
    "100402",--长角恶魔
    "100106",--地狱犬
    "100201",--玛格
    "100502",--恶魔统领BOSS

---------------兽人部落-------------
    "100301",--大耳怪王
    "100206",--座狼
    "100101",--小雷鸟
    "100403",--食人魔王
    "100411",--狼骑兽人
    "100409",--荒漠沙虫
    "100501",--比蒙皇BOSS

---------------冰霜龙族-------------
    "100102",--冰龙宝宝
    "100202",--冰霜熊怪
    "100302",--冰霜巨魔祭祀
    "100407",-- 冰霜龙人
    "100203",--冰霜巨魔龙骑
    "100503",--冰霜巨龙BOSS

---------------熔岩元素-------------
    "100413",--熔岩蜘蛛
    "100104",--熔岩蝙蝠
    "100303",--烈火精灵
    "100412",--熔岩元素
    "100103",--熔岩娜迦卫士
    "100204",--熔岩蛛母
    "100504",--地狱炎魔BOSS

---------------高级恶魔-------------
    "100414",--恶魔爪牙
    "100408",--魅魔
    "100105",--地狱三头犬
    "100415",--恶魔之血
    "100410",--恶魔先锋
    "100205",--堕落天使
    "100505",--大恶魔王BOSS
}

function MonsterOrder.get(i)
    return clone(defines[i])
end

function MonsterOrder.getAll()
    return clone(defines)
end

return MonsterOrder
