
local SpecialTowerProperties = {}

local defines = {}

----------------雷电塔------------------
local tower = {
    mainID        = "160501",    
    towerType     = 5,           -- 炮台类型， 1 = 箭塔, 2 = 炮塔,3 = 仙术塔, 4 = 祭坛塔, 5 = 特殊塔
    name          = "雷电塔",     -- 最多6个中文字
    atkPriority   = {1,4,2,3},   -- first_second_third,1/2/3/4依次对应怪物非/主动/半主动/被动
    attack        = 20,          -- 对目标的伤害
    bulletType    = "150301",    -- 子弹类型，1=箭射，2=爆炸，3=链锁，4=回旋，5=扩散，6=坠砸
    trajectory    = 2,           -- 子弹轨迹，1=直线2=抛物线3=跟踪转圈
    atkNumber     = 1,          -- 同时射几个子弹
    cooldown      = 3000,      -- 开火冷却时间，单位：毫秒/次
    fireRange     = 300,         -- 射程，单位：像素
    critical      = 1000,       -- 暴击率。值代表10%
    criticalPower = 15000,      -- 暴击伤害的威力，150%
    atkGold       = 0,          -- 0代表无法获得金钱，数值代表获得金币量
    addGold       = {0,1400},  --每1.4秒生产0金币
    enemyType     = {1,2},     -- 可以攻击的怪物类型，{1表示对地面，2表示对空，3表示对地下}，不写代表不可攻击
    staticIndex   = 1,
    level         = 1,          -- 塔的等级
    skills            = {
        "1001", "1001",
    },                          --特色塔携带的等级ID
}
defines["160501"] = tower

----------------树人塔------------------
local tower = {
    mainID        = "160502",
    towerType     = 5,        -- 炮台类型， 1 = 箭塔, 2 = 炮塔,3 = 仙术塔, 4 = 祭坛塔, 5 = 特殊塔
    name          = "树人塔",     -- 最多6个中文字
    atkPriority   = {1,4,2,3},   -- first_second_third,1/2/3/4依次对应怪物非/主动/半主动/被动
    attack        = 5,          -- 对目标的伤害
    bulletType    = "150401",    -- 子弹类型，1=箭射，2=爆炸，3=链锁，4=回旋，5=扩散，6=坠砸
    trajectory    = 2,           -- 子弹轨迹，1=直线2=抛物线3=跟踪转圈
    atkNumber     = 1,          -- 同时射几个子弹
    cooldown      = 3000,       -- 开火冷却时间，单位：毫秒/次
    fireRange     = 300,         -- 射程，单位：像素
    critical      = 1000,       -- 暴击率。值代表10%
    criticalPower = 15000,      -- 暴击伤害的威力，150%
    atkGold       = 0,          -- 0代表无法获得金钱，数值代表获得金币量
    addGold       = {0,1400},  --每1.4秒生产0金币
    enemyType     = {1,2},     -- 可以攻击的怪物类型，{1表示对地面，2表示对空，3表示对地下}，不写代表不可攻击
    staticIndex   = 1,
    level         = 1,          -- 塔的等级
    skills            = {
        "1001", "1001",
    },                          --特色塔携带的等级ID
}
defines["160502"] = tower

----------------流星塔------------------
local tower = {
    mainID        = "160503",
    towerType     = 5,        -- 炮台类型， 1 = 箭塔, 2 = 炮塔,3 = 仙术塔, 4 = 祭坛塔, 5 = 特殊塔
    name          = "流星女神",     -- 最多6个中文字
    atkPriority   = {1,4,2,3},   -- first_second_third,1/2/3/4依次对应怪物非/主动/半主动/被动
    attack        = 10,          -- 对目标的伤害
    bulletType    = "150601",    -- 子弹类型，1=箭射，2=爆炸，3=链锁，4=回旋，5=扩散，6=坠砸
    trajectory    = 2,           -- 子弹轨迹，1=直线2=抛物线3=跟踪转圈
    atkNumber     = 1,          -- 同时射几个子弹
    cooldown      = 6000,      -- 开火冷却时间，单位：毫秒/次
    fireRange     = 300,         -- 射程，单位：像素
    critical      = 1000,       -- 暴击率。值代表10%
    criticalPower = 15000,      -- 暴击伤害的威力，150%
    atkGold       = 0,          -- 0代表无法获得金钱，数值代表获得金币量
    addGold       = {0,1400},  --每1.4秒生产0金币
    enemyType     = {1,2},     -- 可以攻击的怪物类型，{1表示对地面，2表示对空，3表示对地下}，不写代表不可攻击
    staticIndex   = 1,
    level         = 1,          -- 塔的等级
    skills            = {
        "1001", "1001",
    },                          --特色塔携带的等级ID
}
defines["160503"] = tower  

----------------跟踪炮塔------------------
local tower = {
    mainID        = "160505",
    towerType     = 5,        -- 炮台类型， 1 = 箭塔, 2 = 炮塔,3 = 仙术塔, 4 = 祭坛塔, 5 = 特殊塔
    name          = "跟踪炮塔",     -- 最多6个中文字
    atkPriority   = {1,4,2,3},   -- first_second_third,1/2/3/4依次对应怪物非/主动/半主动/被动
    attack        = 5,          -- 对目标的伤害
    bulletType    = "150205",    -- 子弹类型，1=箭射，2=爆炸，3=链锁，4=回旋，5=扩散，6=坠砸
    trajectory    = 3,           -- 子弹轨迹，1=直线2=抛物线3=跟踪转圈
    atkNumber     = 1,          -- 同时射几个子弹
    cooldown      = 3000,       -- 开火冷却时间，单位：毫秒/次
    fireRange     = 240,         -- 射程，单位：像素
    critical      = 1000,       -- 暴击率。值代表10%
    criticalPower = 15000,      -- 暴击伤害的威力，150%
    atkGold       = 0,          -- 0代表每次攻击无法获得金钱，数值代表获得金币量
    addGold       = {0,3000},  --每1.4秒生产0金币
    enemyType     = {1,2},     -- 可以攻击的怪物类型，{1表示对地面，2表示对空，3表示对地下}，不写代表不可攻击
    staticIndex   = 1,
    level         = 1,          -- 塔的等级
    skills            = {
        "1001", "1001",
    },                          --特色塔携带的等级ID
}
defines["160505"] = tower  
----------------扩散火塔------------------
local tower = {
    mainID        = "160506",
    towerType     = 5,        -- 炮台类型， 1 = 箭塔, 2 = 炮塔,3 = 仙术塔, 4 = 祭坛塔, 5 = 特殊塔
    name          = "扩散活树塔",     -- 最多6个中文字
    atkPriority   = {1,4,2,3},   -- first_second_third,1/2/3/4依次对应怪物非/主动/半主动/被动
    attack        = 5,          -- 对目标的伤害
    bulletType    = "150501",    -- 子弹类型，1=箭射，2=爆炸，3=链锁，4=回旋，5=扩散，6=坠砸
    trajectory    = 1,           -- 子弹轨迹，1=直线2=抛物线3=跟踪转圈
    atkNumber     = 1,          -- 同时射几个子弹
    cooldown      = 1389,       -- 开火冷却时间，单位：毫秒/次
    fireRange     = 240,         -- 射程，单位：像素
    critical      = 1000,       -- 暴击率。值代表10%
    criticalPower = 15000,      -- 暴击伤害的威力，150%
    atkGold       = 0,          -- 0代表每次攻击无法获得金钱，数值代表获得金币量
    addGold       = {0,3000},  --每1.4秒生产0金币
    enemyType     = {1,2},     -- 可以攻击的怪物类型，{1表示对地面，2表示对空，3表示对地下}，不写代表不可攻击
    staticIndex   = 1,
    level         = 1,          -- 塔的等级
    skills            = {
        "1001", "1001",
    },                          --特色塔携带的等级ID
}
defines["160506"] = tower  

----------------熔岩关卡特殊熔岩柱（特殊塔）------------------
local tower = {
    mainID        = "160512",
    towerType     = 5,        -- 炮台类型， 1 = 箭塔, 2 = 炮塔,3 = 仙术塔, 4 = 祭坛塔, 5 = 特殊塔
    name          = "慢速中式炮塔",     -- 最多6个中文字
    atkPriority   = {1,4,2,3},   -- first_second_third,1/2/3/4依次对应怪物非/主动/半主动/被动
    attack        = 25,          -- 对目标的伤害
    bulletType    = "150202",    -- 子弹类型，1=箭射，2=爆炸，3=链锁，4=回旋，5=扩散，6=坠砸
    trajectory    = 2,           -- 子弹轨迹，1=直线2=抛物线3=跟踪转圈
    atkNumber     = 5,          -- 同时射几个子弹
    cooldown      = 5000,       -- 开火冷却时间，单位：毫秒/次
    fireRange     = 300,        -- 射程，单位：像素
    critical      = 1000,       -- 暴击率。值代表10%
    criticalPower = 15000,      -- 暴击伤害的威力，150%
    atkGold       = 0,          -- 0代表每次攻击无法获得金钱，数值代表获得金币量
    addGold       = {0,3000},   --每1.4秒生产0金币
    enemyType     = {1},        -- 可以攻击的怪物类型，{1表示对地面，2表示对空，3表示对地下}，不写代表不可攻击
    staticIndex   = 1,
    level         = 1,          -- 塔的等级
    skills            = {
        "1001", "1001",
    },                          --特色塔携带的等级ID
}
defines["160512"] = tower

-----------------------------------------------------------
----------------1关卡特殊塔（赠送祭坛塔）------------------
local tower = {
    mainID        = "160401",
    towerType     = 5,        -- 炮台类型， 1 = 箭塔, 2 = 炮塔,3 = 仙术塔, 4 = 祭坛塔, 5 = 特殊塔
    name          = "1关卡祭坛塔",     -- 最多6个中文字
    atkPriority   = {1,4,2,3},   -- first_second_third,1/2/3/4依次对应怪物非/主动/半主动/被动
    attack        = 2,           -- 对目标的伤害
    -- bulletType    = "150102",    -- 子弹类型，1=箭射，2=爆炸，3=链锁，4=回旋，5=扩散，6=坠砸
    -- trajectory    = 2,           -- 子弹轨迹，1=直线2=抛物线3=跟踪转圈
    -- atkNumber     = 1,          -- 同时射几个子弹
    -- cooldown      = 1389,       -- 开火冷却时间，单位：毫秒/次
    -- fireRange     = 380,         -- 射程，单位：像素
    critical      = 1000,       -- 暴击率。值代表10%
    criticalPower = 15000,      -- 暴击伤害的威力，150%
    atkGold       = 1,          -- 0代表每次攻击无法获得金钱，数值代表获得金币量
    addGold       = {10,3000},   --每1.4秒生产0金币
    plunderRange  = 280,        -- 援兵与掠夺范围
    restorePower  = {3, 300},   --掠夺回复，{X能量/秒，最大能量} 积累满能量时，激活掠夺功能
    plunderFactor = {1, 1},     --掠夺系数,{掠夺系数, 单怪固定数值} 掠夺金钱=范围内怪物数量*掠夺系数+固定数值
    soldiers      = {{"170301", 75}, {"170204", 150}, {"170106", 300}},  --三种援兵召唤各自消耗金币数量
    enemyType     = {1,2},      -- 可以攻击的怪物类型，{1表示对地面，2表示对空，3表示对地下}，不写代表不可攻击
    staticIndex   = 1,
    level         = 1,          -- 塔的等级
}
defines["160401"] = tower

----------------2关卡特殊塔（赠送祭坛塔）------------------
local tower = {
    mainID        = "160406",
    towerType     = 5,        -- 炮台类型， 1 = 箭塔, 2 = 炮塔,3 = 仙术塔, 4 = 祭坛塔, 5 = 特殊塔
    name          = "2关卡祭坛塔",     -- 最多6个中文字
    atkPriority   = {1,4,2,3},   -- first_second_third,1/2/3/4依次对应怪物非/主动/半主动/被动
    attack        = 2,           -- 对目标的伤害
    -- bulletType    = "150102",    -- 子弹类型，1=箭射，2=爆炸，3=链锁，4=回旋，5=扩散，6=坠砸
    -- trajectory    = 2,           -- 子弹轨迹，1=直线2=抛物线3=跟踪转圈
    -- atkNumber     = 1,          -- 同时射几个子弹
    -- cooldown      = 1323,       -- 开火冷却时间，单位：毫秒/次
    -- fireRange     = 380,         -- 射程，单位：像素
    critical      = 1000,       -- 暴击率。值代表10%
    criticalPower = 15000,      -- 暴击伤害的威力，150%
    atkGold       = 1,          -- 0代表每次攻击无法获得金钱，数值代表获得金币量
    addGold       = {13,3000},   --每1.4秒生产0金币
    plunderRange  = 220,         -- 援兵与掠夺范围
    restorePower  = {3, 300},  --掠夺回复，{X能量/秒，最大能量} 积累满能量时，激活掠夺功能
    plunderFactor = {1, 1},     --掠夺系数,{掠夺系数, 单怪固定数值} 掠夺金钱=范围内怪物数量*掠夺系数+固定数值
    soldiers      = {{"170301", 75}, {"170204", 150}, {"170106", 300}},  --三种援兵召唤各自消耗金币数量
    enemyType     = {1,2},     -- 可以攻击的怪物类型，{1表示对地面，2表示对空，3表示对地下}，不写代表不可攻击
    staticIndex   = 1,
    level         = 1,          -- 塔的等级
}
defines["160406"] = tower

----------------3关卡特殊塔（赠送祭坛塔）------------------
local tower = {
    mainID        = "160411",
    towerType     = 5,        -- 炮台类型， 1 = 箭塔, 2 = 炮塔,3 = 仙术塔, 4 = 祭坛塔, 5 = 特殊塔
    name          = "3关卡祭坛塔",     -- 最多6个中文字
    atkPriority   = {1,4,2,3},   -- first_second_third,1/2/3/4依次对应怪物非/主动/半主动/被动
    attack        = 2,           -- 对目标的伤害
    -- bulletType    = "150102",    -- 子弹类型，1=箭射，2=爆炸，3=链锁，4=回旋，5=扩散，6=坠砸
    -- trajectory    = 2,           -- 子弹轨迹，1=直线2=抛物线3=跟踪转圈
    -- atkNumber     = 1,          -- 同时射几个子弹
    -- cooldown      = 1260,       -- 开火冷却时间，单位：毫秒/次
    -- fireRange     = 380,         -- 射程，单位：像素
    critical      = 1000,       -- 暴击率。值代表10%
    criticalPower = 15000,      -- 暴击伤害的威力，150%
    atkGold       = 1,          -- 0代表每次攻击无法获得金钱，数值代表获得金币量
    addGold       = {15,3000},   --每1.4秒生产0金币
    plunderRange  = 260,         -- 援兵与掠夺范围
    restorePower  = {4, 100},  --掠夺回复，{X能量/秒，最大能量} 积累满能量时，激活掠夺功能
    plunderFactor = {10, 30},     --掠夺系数,{掠夺系数, 单怪固定数值} 掠夺金钱=范围内怪物数量*掠夺系数+固定数值
    soldiers      = {{"170301", 75}, {"170204", 150}, {"170106", 300}},  --三种援兵召唤各自消耗金币数量
    enemyType     = {1,2},     -- 可以攻击的怪物类型，{1表示对地面，2表示对空，3表示对地下}，不写代表不可攻击
    staticIndex   = 1,
    level         = 1,          -- 塔的等级
}
defines["160411"] = tower

----------------4关卡特殊塔（赠送祭坛塔）------------------
local tower = {
    mainID        = "160416",
    towerType     = 5,        -- 炮台类型， 1 = 箭塔, 2 = 炮塔,3 = 仙术塔, 4 = 祭坛塔, 5 = 特殊塔
    name          = "4关卡级祭坛塔",     -- 最多6个中文字
    atkPriority   = {1,4,2,3},   -- first_second_third,1/2/3/4依次对应怪物非/主动/半主动/被动
    attack        = 2,           -- 对目标的伤害
    -- bulletType    = "150102",    -- 子弹类型，1=箭射，2=爆炸，3=链锁，4=回旋，5=扩散，6=坠砸
    -- trajectory    = 2,           -- 子弹轨迹，1=直线2=抛物线3=跟踪转圈
    -- atkNumber     = 1,          -- 同时射几个子弹
    -- cooldown      = 1200,       -- 开火冷却时间，单位：毫秒/次
    -- fireRange     = 380,         -- 射程，单位：像素
    critical      = 1000,       -- 暴击率。值代表10%
    criticalPower = 15000,      -- 暴击伤害的威力，150%
    atkGold       = 1,          -- 0代表每次攻击无法获得金钱，数值代表获得金币量
    addGold       = {30,3000},   --每1.4秒生产0金币
    plunderRange  = 260,         -- 援兵与掠夺范围
    restorePower  = {3, 220},  --掠夺回复，{X能量/秒，最大能量} 积累满能量时，激活掠夺功能
    plunderFactor = {17, 30},     --掠夺系数,{掠夺系数, 单怪固定数值} 掠夺金钱=范围内怪物数量*掠夺系数+固定数值
    soldiers      = {{"170301", 75}, {"170204", 150}, {"170106", 300}},  --三种援兵召唤各自消耗金币数量
    enemyType     = {1,2},     -- 可以攻击的怪物类型，{1表示对地面，2表示对空，3表示对地下}，不写代表不可攻击
    staticIndex   = 1,
    level         = 1,          -- 塔的等级
}
defines["160416"] = tower

----------------5关卡特殊塔（赠送祭坛塔）------------------
local tower = {
    mainID        = "160421",
    towerType     = 5,        -- 炮台类型， 1 = 箭塔, 2 = 炮塔,3 = 仙术塔, 4 = 祭坛塔, 5 = 特殊塔
    name          = "5关卡祭坛塔",     -- 最多6个中文字
    atkPriority   = {1,4,2,3},   -- first_second_third,1/2/3/4依次对应怪物非/主动/半主动/被动
    attack        = 2,           -- 对目标的伤害
    -- bulletType    = "150102",    -- 子弹类型，1=箭射，2=爆炸，3=链锁，4=回旋，5=扩散，6=坠砸
    -- trajectory    = 2,           -- 子弹轨迹，1=直线2=抛物线3=跟踪转圈
    -- atkNumber     = 1,          -- 同时射几个子弹
    -- cooldown      = 1143,       -- 开火冷却时间，单位：毫秒/次
    -- fireRange     = 380,         -- 射程，单位：像素
    critical      = 1000,       -- 暴击率。值代表10%
    criticalPower = 15000,      -- 暴击伤害的威力，150%
    atkGold       = 1,          -- 0代表每次攻击无法获得金钱，数值代表获得金币量
    addGold       = {35,3000},   --每1.4秒生产0金币
    plunderRange  = 260,         -- 援兵与掠夺范围
    restorePower  = {5, 220},  --掠夺回复，{X能量/秒，最大能量} 积累满能量时，激活掠夺功能
    plunderFactor = {30, 50},     --掠夺系数,{掠夺系数, 单怪固定数值} 掠夺金钱=范围内怪物数量*掠夺系数+固定数值
    soldiers      = {{"170301", 75}, {"170204", 150}, {"170106", 300}},  --三种援兵召唤各自消耗金币数量
    enemyType     = {1,2},     -- 可以攻击的怪物类型，{1表示对地面，2表示对空，3表示对地下}，不写代表不可攻击
    staticIndex   = 1,
    level         = 1,          -- 塔的等级
}
defines["160421"] = tower

----------------6关卡特殊塔（赠送祭坛塔）------------------
local tower = {
    mainID        = "160426",
    towerType     = 5,        -- 炮台类型， 1 = 箭塔, 2 = 炮塔,3 = 仙术塔, 4 = 祭坛塔, 5 = 特殊塔
    name          = "6关卡祭坛塔",     -- 最多6个中文字
    atkPriority   = {1,4,2,3},   -- first_second_third,1/2/3/4依次对应怪物非/主动/半主动/被动
    attack        = 2,           -- 对目标的伤害
    -- bulletType    = "150102",    -- 子弹类型，1=箭射，2=爆炸，3=链锁，4=回旋，5=扩散，6=坠砸
    -- trajectory    = 2,           -- 子弹轨迹，1=直线2=抛物线3=跟踪转圈
    -- atkNumber     = 1,          -- 同时射几个子弹
    -- cooldown      = 1143,       -- 开火冷却时间，单位：毫秒/次
    -- fireRange     = 380,         -- 射程，单位：像素
    critical      = 1000,       -- 暴击率。值代表10%
    criticalPower = 15000,      -- 暴击伤害的威力，150%
    atkGold       = 1,          -- 0代表每次攻击无法获得金钱，数值代表获得金币量
    addGold       = {30,3000},   --每1.4秒生产0金币
    plunderRange  = 280,         -- 援兵与掠夺范围
    restorePower  = {5, 200},  --掠夺回复，{X能量/秒，最大能量} 积累满能量时，激活掠夺功能
    plunderFactor = {50, 50},     --掠夺系数,{掠夺系数, 单怪固定数值} 掠夺金钱=范围内怪物数量*掠夺系数+固定数值
    soldiers      = {{"170301", 75}, {"170204", 150}, {"170106", 300}},  --三种援兵召唤各自消耗金币数量
    enemyType     = {1,2},     -- 可以攻击的怪物类型，{1表示对地面，2表示对空，3表示对地下}，不写代表不可攻击
    staticIndex   = 1,
    level         = 1,          -- 塔的等级
}
defines["160426"] = tower

----------------7关卡特殊塔（赠送祭坛塔）------------------
local tower = {
    mainID        = "160431",
    towerType     = 5,        -- 炮台类型， 1 = 箭塔, 2 = 炮塔,3 = 仙术塔, 4 = 祭坛塔, 5 = 特殊塔
    name          = "7关卡祭坛塔",     -- 最多6个中文字
    atkPriority   = {1,4,2,3},   -- first_second_third,1/2/3/4依次对应怪物非/主动/半主动/被动
    attack        = 2,           -- 对目标的伤害
    -- bulletType    = "150102",    -- 子弹类型，1=箭射，2=爆炸，3=链锁，4=回旋，5=扩散，6=坠砸
    -- trajectory    = 2,           -- 子弹轨迹，1=直线2=抛物线3=跟踪转圈
    -- atkNumber     = 1,          -- 同时射几个子弹
    -- cooldown      = 1143,       -- 开火冷却时间，单位：毫秒/次
    -- fireRange     = 380,         -- 射程，单位：像素
    critical      = 1000,       -- 暴击率。值代表10%
    criticalPower = 15000,      -- 暴击伤害的威力，150%
    atkGold       = 1,          -- 0代表每次攻击无法获得金钱，数值代表获得金币量
    addGold       = {35,3000},   --每1.4秒生产0金币
    plunderRange  = 280,         -- 援兵与掠夺范围
    restorePower  = {3, 200},     --掠夺回复，{X能量/秒，最大能量} 积累满能量时，激活掠夺功能
    plunderFactor = {35, 50},     --掠夺系数,{掠夺系数, 单怪固定数值} 掠夺金钱=范围内怪物数量*掠夺系数+固定数值
    soldiers      = {{"170301", 75}, {"170204", 150}, {"170106", 300}},  --三种援兵召唤各自消耗金币数量
    enemyType     = {1,2},     -- 可以攻击的怪物类型，{1表示对地面，2表示对空，3表示对地下}，不写代表不可攻击
    staticIndex   = 1,
    level         = 1,          -- 塔的等级
}
defines["160431"] = tower

----------------8关卡特殊塔（赠送祭坛塔）------------------
local tower = {
    mainID        = "160436",
    towerType     = 5,        -- 炮台类型， 1 = 箭塔, 2 = 炮塔,3 = 仙术塔, 4 = 祭坛塔, 5 = 特殊塔
    name          = "8关卡祭坛塔",     -- 最多6个中文字
    atkPriority   = {1,4,2,3},   -- first_second_third,1/2/3/4依次对应怪物非/主动/半主动/被动
    attack        = 2,           -- 对目标的伤害
    -- bulletType    = "150102",    -- 子弹类型，1=箭射，2=爆炸，3=链锁，4=回旋，5=扩散，6=坠砸
    -- trajectory    = 2,           -- 子弹轨迹，1=直线2=抛物线3=跟踪转圈
    -- atkNumber     = 1,          -- 同时射几个子弹
    -- cooldown      = 1143,       -- 开火冷却时间，单位：毫秒/次
    -- fireRange     = 380,         -- 射程，单位：像素
    critical      = 1000,       -- 暴击率。值代表10%
    criticalPower = 15000,      -- 暴击伤害的威力，150%
    atkGold       = 1,          -- 0代表每次攻击无法获得金钱，数值代表获得金币量
    addGold       = {30,3000},   --每1.4秒生产0金币
    plunderRange  = 280,         -- 援兵与掠夺范围
    restorePower  = {3, 220},  --掠夺回复，{X能量/秒，最大能量} 积累满能量时，激活掠夺功能
    plunderFactor = {35, 50},     --掠夺系数,{掠夺系数, 单怪固定数值} 掠夺金钱=范围内怪物数量*掠夺系数+固定数值
    soldiers      = {{"170301", 75}, {"170204", 150}, {"170106", 300}},  --三种援兵召唤各自消耗金币数量
    enemyType     = {1,2},     -- 可以攻击的怪物类型，{1表示对地面，2表示对空，3表示对地下}，不写代表不可攻击
    staticIndex   = 1,
    level         = 1,          -- 塔的等级
}
defines["160436"] = tower

----------------9关卡特殊塔（赠送祭坛塔）------------------
local tower = {
    mainID        = "160441",
    towerType     = 5,        -- 炮台类型， 1 = 箭塔, 2 = 炮塔,3 = 仙术塔, 4 = 祭坛塔, 5 = 特殊塔
    name          = "9关卡祭坛塔",     -- 最多6个中文字
    atkPriority   = {1,4,2,3},   -- first_second_third,1/2/3/4依次对应怪物非/主动/半主动/被动
    attack        = 2,           -- 对目标的伤害
    -- bulletType    = "150102",    -- 子弹类型，1=箭射，2=爆炸，3=链锁，4=回旋，5=扩散，6=坠砸
    -- trajectory    = 2,           -- 子弹轨迹，1=直线2=抛物线3=跟踪转圈
    -- atkNumber     = 1,          -- 同时射几个子弹
    -- cooldown      = 1143,       -- 开火冷却时间，单位：毫秒/次
    -- fireRange     = 380,         -- 射程，单位：像素
    critical      = 1000,       -- 暴击率。值代表10%
    criticalPower = 15000,      -- 暴击伤害的威力，150%
    atkGold       = 1,          -- 0代表每次攻击无法获得金钱，数值代表获得金币量
    addGold       = {35,3000},   --每1.4秒生产0金币
    plunderRange  = 280,         -- 援兵与掠夺范围
    restorePower  = {3, 250},  --掠夺回复，{X能量/秒，最大能量} 积累满能量时，激活掠夺功能
    plunderFactor = {30, 50},     --掠夺系数,{掠夺系数, 单怪固定数值} 掠夺金钱=范围内怪物数量*掠夺系数+固定数值
    soldiers      = {{"170301", 75}, {"170204", 150}, {"170106", 300}},  --三种援兵召唤各自消耗金币数量
    enemyType     = {1,2},     -- 可以攻击的怪物类型，{1表示对地面，2表示对空，3表示对地下}，不写代表不可攻击
    staticIndex   = 1,
    level         = 1,          -- 塔的等级
}
defines["160441"] = tower

----------------10关卡特殊塔（赠送祭坛塔）------------------
local tower = {
    mainID        = "160446",
    towerType     = 5,        -- 炮台类型， 1 = 箭塔, 2 = 炮塔,3 = 仙术塔, 4 = 祭坛塔, 5 = 特殊塔
    name          = "10关卡祭坛塔",     -- 最多6个中文字
    atkPriority   = {1,4,2,3},   -- first_second_third,1/2/3/4依次对应怪物非/主动/半主动/被动
    attack        = 2,           -- 对目标的伤害
    -- bulletType    = "150102",    -- 子弹类型，1=箭射，2=爆炸，3=链锁，4=回旋，5=扩散，6=坠砸
    -- trajectory    = 2,           -- 子弹轨迹，1=直线2=抛物线3=跟踪转圈
    -- atkNumber     = 1,          -- 同时射几个子弹
    -- cooldown      = 1143,       -- 开火冷却时间，单位：毫秒/次
    -- fireRange     = 380,         -- 射程，单位：像素
    critical      = 1000,       -- 暴击率。值代表10%
    criticalPower = 15000,      -- 暴击伤害的威力，150%
    atkGold       = 1,          -- 0代表每次攻击无法获得金钱，数值代表获得金币量
    addGold       = {30,3000},   --每1.4秒生产0金币
    plunderRange  = 280,         -- 援兵与掠夺范围
    restorePower  = {3, 280},  --掠夺回复，{X能量/秒，最大能量} 积累满能量时，激活掠夺功能
    plunderFactor = {35, 50},     --掠夺系数,{掠夺系数, 单怪固定数值} 掠夺金钱=范围内怪物数量*掠夺系数+固定数值
    soldiers      = {{"170301", 75}, {"170204", 150}, {"170106", 300}},  --三种援兵召唤各自消耗金币数量
    enemyType     = {1,2},     -- 可以攻击的怪物类型，{1表示对地面，2表示对空，3表示对地下}，不写代表不可攻击
    staticIndex   = 1,
    level         = 1,          -- 塔的等级
}
defines["160446"] = tower

----------------11关卡特殊塔（赠送祭坛塔）------------------
local tower = {
    mainID        = "160451",
    towerType     = 5,        -- 炮台类型， 1 = 箭塔, 2 = 炮塔,3 = 仙术塔, 4 = 祭坛塔, 5 = 特殊塔
    name          = "11关卡祭坛塔",     -- 最多6个中文字
    atkPriority   = {1,4,2,3},   -- first_second_third,1/2/3/4依次对应怪物非/主动/半主动/被动
    attack        = 2,           -- 对目标的伤害
    -- bulletType    = "150102",    -- 子弹类型，1=箭射，2=爆炸，3=链锁，4=回旋，5=扩散，6=坠砸
    -- trajectory    = 2,           -- 子弹轨迹，1=直线2=抛物线3=跟踪转圈
    -- atkNumber     = 1,          -- 同时射几个子弹
    -- cooldown      = 1143,       -- 开火冷却时间，单位：毫秒/次
    -- fireRange     = 380,         -- 射程，单位：像素
    critical      = 1000,       -- 暴击率。值代表10%
    criticalPower = 15000,      -- 暴击伤害的威力，150%
    atkGold       = 1,          -- 0代表每次攻击无法获得金钱，数值代表获得金币量
    addGold       = {42,3000},   --每1.4秒生产0金币
    plunderRange  = 280,         -- 援兵与掠夺范围
    restorePower  = {3, 220},  --掠夺回复，{X能量/秒，最大能量} 积累满能量时，激活掠夺功能
    plunderFactor = {40, 80},     --掠夺系数,{掠夺系数, 单怪固定数值} 掠夺金钱=范围内怪物数量*掠夺系数+固定数值
    soldiers      = {{"170301", 75}, {"170204", 150}, {"170106", 300}},  --三种援兵召唤各自消耗金币数量
    enemyType     = {1,2},     -- 可以攻击的怪物类型，{1表示对地面，2表示对空，3表示对地下}，不写代表不可攻击
    staticIndex   = 1,
    level         = 1,          -- 塔的等级
}
defines["160451"] = tower

----------------12关卡特殊塔（赠送祭坛塔）------------------
local tower = {
    mainID        = "160456",
    towerType     = 5,        -- 炮台类型， 1 = 箭塔, 2 = 炮塔,3 = 仙术塔, 4 = 祭坛塔, 5 = 特殊塔
    name          = "12关卡祭坛塔",     -- 最多6个中文字
    atkPriority   = {1,4,2,3},   -- first_second_third,1/2/3/4依次对应怪物非/主动/半主动/被动
    attack        = 2,           -- 对目标的伤害
    -- bulletType    = "150102",    -- 子弹类型，1=箭射，2=爆炸，3=链锁，4=回旋，5=扩散，6=坠砸
    -- trajectory    = 2,           -- 子弹轨迹，1=直线2=抛物线3=跟踪转圈
    -- atkNumber     = 1,          -- 同时射几个子弹
    -- cooldown      = 1143,       -- 开火冷却时间，单位：毫秒/次
    -- fireRange     = 380,         -- 射程，单位：像素
    critical      = 1000,       -- 暴击率。值代表10%
    criticalPower = 15000,      -- 暴击伤害的威力，150%
    atkGold       = 1,          -- 0代表每次攻击无法获得金钱，数值代表获得金币量
    addGold       = {0,3000},   --每1.4秒生产0金币
    plunderRange  = 380,         -- 援兵与掠夺范围
    restorePower  = {3, 300},  --掠夺回复，{X能量/秒，最大能量} 积累满能量时，激活掠夺功能
    plunderFactor = {35, 50},     --掠夺系数,{掠夺系数, 单怪固定数值} 掠夺金钱=范围内怪物数量*掠夺系数+固定数值
    soldiers      = {{"170301", 75}, {"170204", 150}, {"170106", 300}},  --三种援兵召唤各自消耗金币数量
    enemyType     = {1,2},     -- 可以攻击的怪物类型，{1表示对地面，2表示对空，3表示对地下}，不写代表不可攻击
    staticIndex   = 1,
    level         = 1,          -- 塔的等级
}
defines["160456"] = tower

----------------13关卡特殊塔（赠送祭坛塔）------------------
local tower = {
    mainID        = "160461",
    towerType     = 5,        -- 炮台类型， 1 = 箭塔, 2 = 炮塔,3 = 仙术塔, 4 = 祭坛塔, 5 = 特殊塔
    name          = "13关卡祭坛塔",     -- 最多6个中文字
    atkPriority   = {1,4,2,3},   -- first_second_third,1/2/3/4依次对应怪物非/主动/半主动/被动
    attack        = 2,           -- 对目标的伤害
    -- bulletType    = "150102",    -- 子弹类型，1=箭射，2=爆炸，3=链锁，4=回旋，5=扩散，6=坠砸
    -- trajectory    = 2,           -- 子弹轨迹，1=直线2=抛物线3=跟踪转圈
    -- atkNumber     = 1,          -- 同时射几个子弹
    -- cooldown      = 1143,       -- 开火冷却时间，单位：毫秒/次
    -- fireRange     = 380,         -- 射程，单位：像素
    critical      = 1000,       -- 暴击率。值代表10%
    criticalPower = 15000,      -- 暴击伤害的威力，150%
    atkGold       = 1,          -- 0代表每次攻击无法获得金钱，数值代表获得金币量
    addGold       = {35,3000},   --每1.4秒生产0金币
    plunderRange  = 260,         -- 援兵与掠夺范围
    restorePower  = {3, 160},  --掠夺回复，{X能量/秒，最大能量} 积累满能量时，激活掠夺功能
    plunderFactor = {35, 50},     --掠夺系数,{掠夺系数, 单怪固定数值} 掠夺金钱=范围内怪物数量*掠夺系数+固定数值
    soldiers      = {{"170301", 75}, {"170204", 150}, {"170106", 300}},  --三种援兵召唤各自消耗金币数量
    enemyType     = {1,2},     -- 可以攻击的怪物类型，{1表示对地面，2表示对空，3表示对地下}，不写代表不可攻击
    staticIndex   = 1,
    level         = 1,          -- 塔的等级
}
defines["160461"] = tower

----------------14关卡特殊塔（赠送祭坛塔）------------------
local tower = {
    mainID        = "160466",
    towerType     = 5,        -- 炮台类型， 1 = 箭塔, 2 = 炮塔,3 = 仙术塔, 4 = 祭坛塔, 5 = 特殊塔
    name          = "14关卡祭坛塔",     -- 最多6个中文字
    atkPriority   = {1,4,2,3},   -- first_second_third,1/2/3/4依次对应怪物非/主动/半主动/被动
    attack        = 2,           -- 对目标的伤害
    -- bulletType    = "150102",    -- 子弹类型，1=箭射，2=爆炸，3=链锁，4=回旋，5=扩散，6=坠砸
    -- trajectory    = 2,           -- 子弹轨迹，1=直线2=抛物线3=跟踪转圈
    -- atkNumber     = 1,          -- 同时射几个子弹
    -- cooldown      = 1143,       -- 开火冷却时间，单位：毫秒/次
    -- fireRange     = 380,         -- 射程，单位：像素
    critical      = 1000,       -- 暴击率。值代表10%
    criticalPower = 15000,      -- 暴击伤害的威力，150%
    atkGold       = 1,          -- 0代表每次攻击无法获得金钱，数值代表获得金币量
    addGold       = {35,3000},   --每1.4秒生产0金币
    plunderRange  = 240,         -- 援兵与掠夺范围
    restorePower  = {3, 240},  --掠夺回复，{X能量/秒，最大能量} 积累满能量时，激活掠夺功能
    plunderFactor = {48, 50},     --掠夺系数,{掠夺系数, 单怪固定数值} 掠夺金钱=范围内怪物数量*掠夺系数+固定数值
    soldiers      = {{"170301", 75}, {"170204", 150}, {"170106", 300}},  --三种援兵召唤各自消耗金币数量
    enemyType     = {1,2},     -- 可以攻击的怪物类型，{1表示对地面，2表示对空，3表示对地下}，不写代表不可攻击
    staticIndex   = 1,
    level         = 1,          -- 塔的等级
}
defines["160466"] = tower

----------------15关卡特殊塔（赠送祭坛塔）------------------
local tower = {
    mainID        = "160471",
    towerType     = 5,        -- 炮台类型， 1 = 箭塔, 2 = 炮塔,3 = 仙术塔, 4 = 祭坛塔, 5 = 特殊塔
    name          = "15关卡祭坛塔",     -- 最多6个中文字
    atkPriority   = {1,4,2,3},   -- first_second_third,1/2/3/4依次对应怪物非/主动/半主动/被动
    attack        = 2,           -- 对目标的伤害
    -- bulletType    = "150102",    -- 子弹类型，1=箭射，2=爆炸，3=链锁，4=回旋，5=扩散，6=坠砸
    -- trajectory    = 2,           -- 子弹轨迹，1=直线2=抛物线3=跟踪转圈
    -- atkNumber     = 1,          -- 同时射几个子弹
    -- cooldown      = 1143,       -- 开火冷却时间，单位：毫秒/次
    -- fireRange     = 380,         -- 射程，单位：像素
    critical      = 1000,       -- 暴击率。值代表10%
    criticalPower = 15000,      -- 暴击伤害的威力，150%
    atkGold       = 1,          -- 0代表每次攻击无法获得金钱，数值代表获得金币量
    addGold       = {50,3000},   --每1.4秒生产0金币
    plunderRange  = 260,         -- 援兵与掠夺范围
    restorePower  = {3, 200},  --掠夺回复，{X能量/秒，最大能量} 积累满能量时，激活掠夺功能
    plunderFactor = {50, 50},     --掠夺系数,{掠夺系数, 单怪固定数值} 掠夺金钱=范围内怪物数量*掠夺系数+固定数值
    soldiers      = {{"170301", 75}, {"170204", 150}, {"170106", 300}},  --三种援兵召唤各自消耗金币数量
    enemyType     = {1,2},     -- 可以攻击的怪物类型，{1表示对地面，2表示对空，3表示对地下}，不写代表不可攻击
    staticIndex   = 1,
    level         = 1,          -- 塔的等级
}
defines["160471"] = tower 
----------------------------------------
----------------第三模式一关祭坛塔------------------
local tower = {
    mainID        = "160486",
    towerType     = 5,        -- 炮台类型， 1 = 箭塔, 2 = 炮塔,3 = 仙术塔, 4 = 祭坛塔, 5 = 特殊塔
    name          = "1关卡祭坛塔",     -- 最多6个中文字
    atkPriority   = {1,4,2,3},   -- first_second_third,1/2/3/4依次对应怪物非/主动/半主动/被动
    attack        = 2,           -- 对目标的伤害
    -- bulletType    = "150102",    -- 子弹类型，1=箭射，2=爆炸，3=链锁，4=回旋，5=扩散，6=坠砸
    -- trajectory    = 2,           -- 子弹轨迹，1=直线2=抛物线3=跟踪转圈
    -- atkNumber     = 1,          -- 同时射几个子弹
    -- cooldown      = 1389,       -- 开火冷却时间，单位：毫秒/次
    -- fireRange     = 380,         -- 射程，单位：像素
    critical      = 1000,       -- 暴击率。值代表10%
    criticalPower = 15000,      -- 暴击伤害的威力，150%
    atkGold       = 1,          -- 0代表每次攻击无法获得金钱，数值代表获得金币量
    addGold       = {0,3000},   --每1.4秒生产0金币
    plunderRange  = 280,        -- 援兵与掠夺范围
    restorePower  = {3, 300},   --掠夺回复，{X能量/秒，最大能量} 积累满能量时，激活掠夺功能
    plunderFactor = {1, 1},     --掠夺系数,{掠夺系数, 单怪固定数值} 掠夺金钱=范围内怪物数量*掠夺系数+固定数值
    soldiers      = {{"170301", 75}, {"170204", 150}, {"170106", 300}},  --三种援兵召唤各自消耗金币数量
    enemyType     = {1,2},      -- 可以攻击的怪物类型，{1表示对地面，2表示对空，3表示对地下}，不写代表不可攻击
    staticIndex   = 1,
    level         = 1,          -- 塔的等级
}
defines["160486"] = tower

----------------第三模式二关祭坛塔------------------
local tower = {
    mainID        = "160487",
    towerType     = 5,        -- 炮台类型， 1 = 箭塔, 2 = 炮塔,3 = 仙术塔, 4 = 祭坛塔, 5 = 特殊塔
    name          = "1关卡祭坛塔",     -- 最多6个中文字
    atkPriority   = {1,4,2,3},   -- first_second_third,1/2/3/4依次对应怪物非/主动/半主动/被动
    attack        = 2,           -- 对目标的伤害
    -- bulletType    = "150102",    -- 子弹类型，1=箭射，2=爆炸，3=链锁，4=回旋，5=扩散，6=坠砸
    -- trajectory    = 2,           -- 子弹轨迹，1=直线2=抛物线3=跟踪转圈
    -- atkNumber     = 1,          -- 同时射几个子弹
    -- cooldown      = 1389,       -- 开火冷却时间，单位：毫秒/次
    -- fireRange     = 380,         -- 射程，单位：像素
    critical      = 1000,       -- 暴击率。值代表10%
    criticalPower = 15000,      -- 暴击伤害的威力，150%
    atkGold       = 1,          -- 0代表每次攻击无法获得金钱，数值代表获得金币量
    addGold       = {0,3000},   --每1.4秒生产0金币
    plunderRange  = 280,        -- 援兵与掠夺范围
    restorePower  = {3, 300},   --掠夺回复，{X能量/秒，最大能量} 积累满能量时，激活掠夺功能
    plunderFactor = {1, 1},     --掠夺系数,{掠夺系数, 单怪固定数值} 掠夺金钱=范围内怪物数量*掠夺系数+固定数值
    soldiers      = {{"170301", 75}, {"170204", 150}, {"170106", 300}},  --三种援兵召唤各自消耗金币数量
    enemyType     = {1,2},      -- 可以攻击的怪物类型，{1表示对地面，2表示对空，3表示对地下}，不写代表不可攻击
    staticIndex   = 1,
    level         = 1,          -- 塔的等级
}
defines["160487"] = tower

----------------第三模式三关祭坛塔------------------
local tower = {
    mainID        = "160481",
    towerType     = 5,        -- 炮台类型， 1 = 箭塔, 2 = 炮塔,3 = 仙术塔, 4 = 祭坛塔, 5 = 特殊塔
    name          = "1关卡祭坛塔",     -- 最多6个中文字
    atkPriority   = {1,4,2,3},   -- first_second_third,1/2/3/4依次对应怪物非/主动/半主动/被动
    attack        = 2,           -- 对目标的伤害
    -- bulletType    = "150102",    -- 子弹类型，1=箭射，2=爆炸，3=链锁，4=回旋，5=扩散，6=坠砸
    -- trajectory    = 2,           -- 子弹轨迹，1=直线2=抛物线3=跟踪转圈
    -- atkNumber     = 1,          -- 同时射几个子弹
    -- cooldown      = 1389,       -- 开火冷却时间，单位：毫秒/次
    -- fireRange     = 380,         -- 射程，单位：像素
    critical      = 1000,       -- 暴击率。值代表10%
    criticalPower = 15000,      -- 暴击伤害的威力，150%
    atkGold       = 1,          -- 0代表每次攻击无法获得金钱，数值代表获得金币量
    addGold       = {0,3000},   --每1.4秒生产0金币
    plunderRange  = 280,        -- 援兵与掠夺范围
    restorePower  = {3, 15},   --掠夺回复，{X能量/秒，最大能量} 积累满能量时，激活掠夺功能
    plunderFactor = {100, 100},     --掠夺系数,{掠夺系数, 单怪固定数值} 掠夺金钱=范围内怪物数量*掠夺系数+固定数值
    soldiers      = {{"170301", 75}, {"170204", 150}, {"170106", 300}},  --三种援兵召唤各自消耗金币数量
    enemyType     = {1,2},      -- 可以攻击的怪物类型，{1表示对地面，2表示对空，3表示对地下}，不写代表不可攻击
    staticIndex   = 1,
    level         = 1,          -- 塔的等级
}
defines["160481"] = tower

----------------第三模式四关祭坛塔------------------
local tower = {
    mainID        = "160488",
    towerType     = 5,        -- 炮台类型， 1 = 箭塔, 2 = 炮塔,3 = 仙术塔, 4 = 祭坛塔, 5 = 特殊塔
    name          = "第三模式四关卡祭坛塔",     -- 最多6个中文字
    atkPriority   = {1,4,2,3},   -- first_second_third,1/2/3/4依次对应怪物非/主动/半主动/被动
    attack        = 2,           -- 对目标的伤害
    -- bulletType    = "150102",    -- 子弹类型，1=箭射，2=爆炸，3=链锁，4=回旋，5=扩散，6=坠砸
    -- trajectory    = 2,           -- 子弹轨迹，1=直线2=抛物线3=跟踪转圈
    -- atkNumber     = 1,          -- 同时射几个子弹
    -- cooldown      = 1260,       -- 开火冷却时间，单位：毫秒/次
    -- fireRange     = 380,         -- 射程，单位：像素
    critical      = 1000,       -- 暴击率。值代表10%
    criticalPower = 15000,      -- 暴击伤害的威力，150%
    atkGold       = 1,          -- 0代表每次攻击无法获得金钱，数值代表获得金币量
    addGold       = {0, 3000},   --每1.4秒生产0金币
    plunderRange  = 260,         -- 援兵与掠夺范围
    restorePower  = {3, 15},  --掠夺回复，{X能量/秒，最大能量} 积累满能量时，激活掠夺功能
    plunderFactor = {60, 100},     --掠夺系数,{掠夺系数, 单怪固定数值} 掠夺金钱=范围内怪物数量*掠夺系数+固定数值
    soldiers      = {{"170301", 75}, {"170204", 150}, {"170106", 300}},  --三种援兵召唤各自消耗金币数量
    enemyType     = {1,2},     -- 可以攻击的怪物类型，{1表示对地面，2表示对空，3表示对地下}，不写代表不可攻击
    staticIndex   = 1,
    level         = 1,          -- 塔的等级
}
defines["160488"] = tower
-----------------------------------

----------------第三模式五关祭坛塔------------------
local tower = {
    mainID        = "160489",
    towerType     = 5,        -- 炮台类型， 1 = 箭塔, 2 = 炮塔,3 = 仙术塔, 4 = 祭坛塔, 5 = 特殊塔
    name          = "第三模式五关卡祭坛塔",     -- 最多6个中文字
    atkPriority   = {1,4,2,3},   -- first_second_third,1/2/3/4依次对应怪物非/主动/半主动/被动
    attack        = 2,           -- 对目标的伤害
    -- bulletType    = "150102",    -- 子弹类型，1=箭射，2=爆炸，3=链锁，4=回旋，5=扩散，6=坠砸
    -- trajectory    = 2,           -- 子弹轨迹，1=直线2=抛物线3=跟踪转圈
    -- atkNumber     = 1,          -- 同时射几个子弹
    -- cooldown      = 1260,       -- 开火冷却时间，单位：毫秒/次
    -- fireRange     = 380,         -- 射程，单位：像素
    critical      = 1000,       -- 暴击率。值代表10%
    criticalPower = 15000,      -- 暴击伤害的威力，150%
    atkGold       = 1,          -- 0代表每次攻击无法获得金钱，数值代表获得金币量
    addGold       = {0, 3000},   --每1.4秒生产0金币
    plunderRange  = 260,         -- 援兵与掠夺范围
    restorePower  = {3, 15},  --掠夺回复，{X能量/秒，最大能量} 积累满能量时，激活掠夺功能
    plunderFactor = {60, 100},     --掠夺系数,{掠夺系数, 单怪固定数值} 掠夺金钱=范围内怪物数量*掠夺系数+固定数值
    soldiers      = {{"170301", 75}, {"170204", 150}, {"170106", 300}},  --三种援兵召唤各自消耗金币数量
    enemyType     = {1,2},     -- 可以攻击的怪物类型，{1表示对地面，2表示对空，3表示对地下}，不写代表不可攻击
    staticIndex   = 1,
    level         = 1,          -- 塔的等级
}
defines["160489"] = tower
-----------------------------------
----------------第三模式六关祭坛塔------------------
local tower = {
    mainID        = "160490",
    towerType     = 5,        -- 炮台类型， 1 = 箭塔, 2 = 炮塔,3 = 仙术塔, 4 = 祭坛塔, 5 = 特殊塔
    name          = "第三模式六关卡祭坛塔",     -- 最多6个中文字
    atkPriority   = {1,4,2,3},   -- first_second_third,1/2/3/4依次对应怪物非/主动/半主动/被动
    attack        = 2,           -- 对目标的伤害
    -- bulletType    = "150102",    -- 子弹类型，1=箭射，2=爆炸，3=链锁，4=回旋，5=扩散，6=坠砸
    -- trajectory    = 2,           -- 子弹轨迹，1=直线2=抛物线3=跟踪转圈
    -- atkNumber     = 1,          -- 同时射几个子弹
    -- cooldown      = 1260,       -- 开火冷却时间，单位：毫秒/次
    -- fireRange     = 380,         -- 射程，单位：像素
    critical      = 1000,       -- 暴击率。值代表10%
    criticalPower = 15000,      -- 暴击伤害的威力，150%
    atkGold       = 1,          -- 0代表每次攻击无法获得金钱，数值代表获得金币量
    addGold       = {0, 3000},   --每1.4秒生产0金币
    plunderRange  = 260,         -- 援兵与掠夺范围
    restorePower  = {3, 15},  --掠夺回复，{X能量/秒，最大能量} 积累满能量时，激活掠夺功能
    plunderFactor = {60, 100},     --掠夺系数,{掠夺系数, 单怪固定数值} 掠夺金钱=范围内怪物数量*掠夺系数+固定数值
    soldiers      = {{"170301", 75}, {"170204", 150}, {"170106", 300}},  --三种援兵召唤各自消耗金币数量
    enemyType     = {1,2},     -- 可以攻击的怪物类型，{1表示对地面，2表示对空，3表示对地下}，不写代表不可攻击
    staticIndex   = 1,
    level         = 1,          -- 塔的等级
}
defines["160490"] = tower
-----------------------------------
----------------第三模式七关祭坛塔------------------
local tower = {
    mainID        = "160492",
    towerType     = 5,        -- 炮台类型， 1 = 箭塔, 2 = 炮塔,3 = 仙术塔, 4 = 祭坛塔, 5 = 特殊塔
    name          = "第三模式七关卡祭坛塔",     -- 最多6个中文字
    atkPriority   = {1,4,2,3},   -- first_second_third,1/2/3/4依次对应怪物非/主动/半主动/被动
    attack        = 2,           -- 对目标的伤害
    -- bulletType    = "150102",    -- 子弹类型，1=箭射，2=爆炸，3=链锁，4=回旋，5=扩散，6=坠砸
    -- trajectory    = 2,           -- 子弹轨迹，1=直线2=抛物线3=跟踪转圈
    -- atkNumber     = 1,          -- 同时射几个子弹
    -- cooldown      = 1260,       -- 开火冷却时间，单位：毫秒/次
    -- fireRange     = 380,         -- 射程，单位：像素
    critical      = 1000,       -- 暴击率。值代表10%
    criticalPower = 15000,      -- 暴击伤害的威力，150%
    atkGold       = 1,          -- 0代表每次攻击无法获得金钱，数值代表获得金币量
    addGold       = {30, 3000},   --每1.4秒生产0金币
    plunderRange  = 260,         -- 援兵与掠夺范围
    restorePower  = {3, 15},  --掠夺回复，{X能量/秒，最大能量} 积累满能量时，激活掠夺功能
    plunderFactor = {10, 50},     --掠夺系数,{掠夺系数, 单怪固定数值} 掠夺金钱=范围内怪物数量*掠夺系数+固定数值
    soldiers      = {{"170301", 75}, {"170204", 150}, {"170106", 300}},  --三种援兵召唤各自消耗金币数量
    enemyType     = {1,2},     -- 可以攻击的怪物类型，{1表示对地面，2表示对空，3表示对地下}，不写代表不可攻击
    staticIndex   = 1,
    level         = 1,          -- 塔的等级
}
defines["160492"] = tower
-----------------------------------

----------------第三模式八关祭坛塔------------------
local tower = {
    mainID        = "160482",
    towerType     = 5,        -- 炮台类型， 1 = 箭塔, 2 = 炮塔,3 = 仙术塔, 4 = 祭坛塔, 5 = 特殊塔
    name          = "第三模式8关卡祭坛塔",     -- 最多6个中文字
    atkPriority   = {1,4,2,3},   -- first_second_third,1/2/3/4依次对应怪物非/主动/半主动/被动
    attack        = 2,           -- 对目标的伤害
    -- bulletType    = "150102",    -- 子弹类型，1=箭射，2=爆炸，3=链锁，4=回旋，5=扩散，6=坠砸
    -- trajectory    = 2,           -- 子弹轨迹，1=直线2=抛物线3=跟踪转圈
    -- atkNumber     = 1,          -- 同时射几个子弹
    -- cooldown      = 1260,       -- 开火冷却时间，单位：毫秒/次
    -- fireRange     = 380,         -- 射程，单位：像素
    critical      = 1000,       -- 暴击率。值代表10%
    criticalPower = 15000,      -- 暴击伤害的威力，150%
    atkGold       = 1,          -- 0代表每次攻击无法获得金钱，数值代表获得金币量
    addGold       = {40, 3000},   --每1.4秒生产0金币
    plunderRange  = 260,         -- 援兵与掠夺范围
    restorePower  = {3, 220},  --掠夺回复，{X能量/秒，最大能量} 积累满能量时，激活掠夺功能
    plunderFactor = {50, 50},     --掠夺系数,{掠夺系数, 单怪固定数值} 掠夺金钱=范围内怪物数量*掠夺系数+固定数值
    soldiers      = {{"170301", 75}, {"170204", 150}, {"170106", 300}},  --三种援兵召唤各自消耗金币数量
    enemyType     = {1,2},     -- 可以攻击的怪物类型，{1表示对地面，2表示对空，3表示对地下}，不写代表不可攻击
    staticIndex   = 1,
    level         = 1,          -- 塔的等级
}
defines["160482"] = tower
-----------------------------------
----------------第三模式九关祭坛塔------------------
local tower = {
    mainID        = "160483",
    towerType     = 5,        -- 炮台类型， 1 = 箭塔, 2 = 炮塔,3 = 仙术塔, 4 = 祭坛塔, 5 = 特殊塔
    name          = "第三模式9关卡祭坛塔",     -- 最多6个中文字
    atkPriority   = {1,4,2,3},   -- first_second_third,1/2/3/4依次对应怪物非/主动/半主动/被动
    attack        = 2,           -- 对目标的伤害
    -- bulletType    = "150102",    -- 子弹类型，1=箭射，2=爆炸，3=链锁，4=回旋，5=扩散，6=坠砸
    -- trajectory    = 2,           -- 子弹轨迹，1=直线2=抛物线3=跟踪转圈
    -- atkNumber     = 1,          -- 同时射几个子弹
    -- cooldown      = 1260,       -- 开火冷却时间，单位：毫秒/次
    -- fireRange     = 380,         -- 射程，单位：像素
    critical      = 1000,       -- 暴击率。值代表10%
    criticalPower = 15000,      -- 暴击伤害的威力，150%
    atkGold       = 1,          -- 0代表每次攻击无法获得金钱，数值代表获得金币量
    addGold       = {30, 3000},   --每1.4秒生产0金币
    plunderRange  = 260,         -- 援兵与掠夺范围
    restorePower  = {3, 300},  --掠夺回复，{X能量/秒，最大能量} 积累满能量时，激活掠夺功能
    plunderFactor = {50, 50},     --掠夺系数,{掠夺系数, 单怪固定数值} 掠夺金钱=范围内怪物数量*掠夺系数+固定数值
    soldiers      = {{"170301", 75}, {"170204", 150}, {"170106", 300}},  --三种援兵召唤各自消耗金币数量
    enemyType     = {1,2},     -- 可以攻击的怪物类型，{1表示对地面，2表示对空，3表示对地下}，不写代表不可攻击
    staticIndex   = 1,
    level         = 1,          -- 塔的等级
}
defines["160483"] = tower

----------------第三模式十关祭坛塔------------------
local tower = {
    mainID        = "160494",
    towerType     = 5,        -- 炮台类型， 1 = 箭塔, 2 = 炮塔,3 = 仙术塔, 4 = 祭坛塔, 5 = 特殊塔
    name          = "第三模式10关卡祭坛塔",     -- 最多6个中文字
    atkPriority   = {1,4,2,3},   -- first_second_third,1/2/3/4依次对应怪物非/主动/半主动/被动
    attack        = 2,           -- 对目标的伤害
    -- bulletType    = "150102",    -- 子弹类型，1=箭射，2=爆炸，3=链锁，4=回旋，5=扩散，6=坠砸
    -- trajectory    = 2,           -- 子弹轨迹，1=直线2=抛物线3=跟踪转圈
    -- atkNumber     = 1,          -- 同时射几个子弹
    -- cooldown      = 1143,       -- 开火冷却时间，单位：毫秒/次
    -- fireRange     = 380,         -- 射程，单位：像素
    critical      = 1000,       -- 暴击率。值代表10%
    criticalPower = 15000,      -- 暴击伤害的威力，150%
    atkGold       = 1,          -- 0代表每次攻击无法获得金钱，数值代表获得金币量
    addGold       = {25,3000},   --每1.4秒生产0金币
    plunderRange  = 280,         -- 援兵与掠夺范围
    restorePower  = {3, 100},  --掠夺回复，{X能量/秒，最大能量} 积累满能量时，激活掠夺功能
    plunderFactor = {20, 50},     --掠夺系数,{掠夺系数, 单怪固定数值} 掠夺金钱=范围内怪物数量*掠夺系数+固定数值
    soldiers      = {{"170301", 75}, {"170204", 150}, {"170106", 300}},  --三种援兵召唤各自消耗金币数量
    enemyType     = {1,2},     -- 可以攻击的怪物类型，{1表示对地面，2表示对空，3表示对地下}，不写代表不可攻击
    staticIndex   = 1,
    level         = 1,          -- 塔的等级
}
defines["160494"] = tower

----------------第三模式十一关祭坛塔------------------
local tower = {
    mainID        = "160484",
    towerType     = 5,        -- 炮台类型， 1 = 箭塔, 2 = 炮塔,3 = 仙术塔, 4 = 祭坛塔, 5 = 特殊塔
    name          = "第三模式十一关卡祭坛塔",     -- 最多6个中文字
    atkPriority   = {1,4,2,3},   -- first_second_third,1/2/3/4依次对应怪物非/主动/半主动/被动
    attack        = 2,           -- 对目标的伤害
    -- bulletType    = "150102",    -- 子弹类型，1=箭射，2=爆炸，3=链锁，4=回旋，5=扩散，6=坠砸
    -- trajectory    = 2,           -- 子弹轨迹，1=直线2=抛物线3=跟踪转圈
    -- atkNumber     = 1,          -- 同时射几个子弹
    -- cooldown      = 1260,       -- 开火冷却时间，单位：毫秒/次
    -- fireRange     = 380,         -- 射程，单位：像素
    critical      = 1000,       -- 暴击率。值代表10%
    criticalPower = 15000,      -- 暴击伤害的威力，150%
    atkGold       = 1,          -- 0代表每次攻击无法获得金钱，数值代表获得金币量
    addGold       = {0, 3000},   --每1.4秒生产0金币
    plunderRange  = 260,         -- 援兵与掠夺范围
    restorePower  = {3, 300},  --掠夺回复，{X能量/秒，最大能量} 积累满能量时，激活掠夺功能
    plunderFactor = {50, 50},     --掠夺系数,{掠夺系数, 单怪固定数值} 掠夺金钱=范围内怪物数量*掠夺系数+固定数值
    soldiers      = {{"170301", 75}, {"170204", 150}, {"170106", 300}},  --三种援兵召唤各自消耗金币数量
    enemyType     = {1,2},     -- 可以攻击的怪物类型，{1表示对地面，2表示对空，3表示对地下}，不写代表不可攻击
    staticIndex   = 1,
    level         = 1,          -- 塔的等级
}
defines["160484"] = tower

----------------第三模式十二关祭坛塔------------------
local tower = {
    mainID        = "160485",
    towerType     = 5,        -- 炮台类型， 1 = 箭塔, 2 = 炮塔,3 = 仙术塔, 4 = 祭坛塔, 5 = 特殊塔
    name          = "第三模式十二关卡祭坛塔",     -- 最多6个中文字
    atkPriority   = {1,4,2,3},   -- first_second_third,1/2/3/4依次对应怪物非/主动/半主动/被动
    attack        = 2,           -- 对目标的伤害
    -- bulletType    = "150102",    -- 子弹类型，1=箭射，2=爆炸，3=链锁，4=回旋，5=扩散，6=坠砸
    -- trajectory    = 2,           -- 子弹轨迹，1=直线2=抛物线3=跟踪转圈
    -- atkNumber     = 1,          -- 同时射几个子弹
    -- cooldown      = 1260,       -- 开火冷却时间，单位：毫秒/次
    -- fireRange     = 380,         -- 射程，单位：像素
    critical      = 1000,       -- 暴击率。值代表10%
    criticalPower = 15000,      -- 暴击伤害的威力，150%
    atkGold       = 1,          -- 0代表每次攻击无法获得金钱，数值代表获得金币量
    addGold       = {50, 3000},   --每1.4秒生产0金币
    plunderRange  = 380,         -- 援兵与掠夺范围
    restorePower  = {3, 100},  --掠夺回复，{X能量/秒，最大能量} 积累满能量时，激活掠夺功能
    plunderFactor = {50, 50},     --掠夺系数,{掠夺系数, 单怪固定数值} 掠夺金钱=范围内怪物数量*掠夺系数+固定数值
    soldiers      = {{"170301", 75}, {"170204", 150}, {"170106", 300}},  --三种援兵召唤各自消耗金币数量
    enemyType     = {1,2},     -- 可以攻击的怪物类型，{1表示对地面，2表示对空，3表示对地下}，不写代表不可攻击
    staticIndex   = 1,
    level         = 1,          -- 塔的等级
}
defines["160485"] = tower

----------------第三模式十三关祭坛塔------------------
local tower = {
    mainID        = "160491",
    towerType     = 5,        -- 炮台类型， 1 = 箭塔, 2 = 炮塔,3 = 仙术塔, 4 = 祭坛塔, 5 = 特殊塔
    name          = "第三模式十三关卡祭坛塔",     -- 最多6个中文字
    atkPriority   = {1,4,2,3},   -- first_second_third,1/2/3/4依次对应怪物非/主动/半主动/被动
    attack        = 2,           -- 对目标的伤害
    -- bulletType    = "150102",    -- 子弹类型，1=箭射，2=爆炸，3=链锁，4=回旋，5=扩散，6=坠砸
    -- trajectory    = 2,           -- 子弹轨迹，1=直线2=抛物线3=跟踪转圈
    -- atkNumber     = 1,          -- 同时射几个子弹
    -- cooldown      = 1260,       -- 开火冷却时间，单位：毫秒/次
    -- fireRange     = 380,         -- 射程，单位：像素
    critical      = 1000,       -- 暴击率。值代表10%
    criticalPower = 15000,      -- 暴击伤害的威力，150%
    atkGold       = 1,          -- 0代表每次攻击无法获得金钱，数值代表获得金币量
    addGold       = {6, 3000},   --每1.4秒生产0金币
    plunderRange  = 240,         -- 援兵与掠夺范围
    restorePower  = {3, 80},  --掠夺回复，{X能量/秒，最大能量} 积累满能量时，激活掠夺功能
    plunderFactor = {50, 50},     --掠夺系数,{掠夺系数, 单怪固定数值} 掠夺金钱=范围内怪物数量*掠夺系数+固定数值
    soldiers      = {{"170301", 75}, {"170204", 150}, {"170106", 300}},  --三种援兵召唤各自消耗金币数量
    enemyType     = {1,2},     -- 可以攻击的怪物类型，{1表示对地面，2表示对空，3表示对地下}，不写代表不可攻击
    staticIndex   = 1,
    level         = 1,          -- 塔的等级
}
defines["160491"] = tower

----------------第三模式十四关祭坛塔------------------
local tower = {
    mainID        = "160493",
    towerType     = 5,        -- 炮台类型， 1 = 箭塔, 2 = 炮塔,3 = 仙术塔, 4 = 祭坛塔, 5 = 特殊塔
    name          = "第三模式十四关卡祭坛塔",     -- 最多6个中文字
    atkPriority   = {1,4,2,3},   -- first_second_third,1/2/3/4依次对应怪物非/主动/半主动/被动
    attack        = 2,           -- 对目标的伤害
    -- bulletType    = "150102",    -- 子弹类型，1=箭射，2=爆炸，3=链锁，4=回旋，5=扩散，6=坠砸
    -- trajectory    = 2,           -- 子弹轨迹，1=直线2=抛物线3=跟踪转圈
    -- atkNumber     = 1,          -- 同时射几个子弹
    -- cooldown      = 1260,       -- 开火冷却时间，单位：毫秒/次
    -- fireRange     = 380,         -- 射程，单位：像素
    critical      = 1000,       -- 暴击率。值代表10%
    criticalPower = 15000,      -- 暴击伤害的威力，150%
    atkGold       = 1,          -- 0代表每次攻击无法获得金钱，数值代表获得金币量
    addGold       = {15, 3000},   --每1.4秒生产0金币
    plunderRange  = 240,         -- 援兵与掠夺范围
    restorePower  = {3, 200},  --掠夺回复，{X能量/秒，最大能量} 积累满能量时，激活掠夺功能
    plunderFactor = {50, 50},     --掠夺系数,{掠夺系数, 单怪固定数值} 掠夺金钱=范围内怪物数量*掠夺系数+固定数值
    soldiers      = {{"170301", 75}, {"170204", 150}, {"170106", 300}},  --三种援兵召唤各自消耗金币数量
    enemyType     = {1,2},     -- 可以攻击的怪物类型，{1表示对地面，2表示对空，3表示对地下}，不写代表不可攻击
    staticIndex   = 1,
    level         = 1,          -- 塔的等级
}
defines["160493"] = tower
-----------------------------------

function SpecialTowerProperties.get(id)
    -- print("SpecialTowerProperties.get(id) id = "..tostring(id))
    return clone(defines[id])
end

return SpecialTowerProperties